<?php
// Version: 2.0; EmailTemplates

// Since all of these strings are being used in emails, numeric entities should be used.

// Do not translate anything that is between {}, they are used as replacement variables and MUST remain exactly how they are.

$txt['regards_team'] = 'С уважением,
команда форума {FORUMNAME}.';

$txt['scheduled_approval_email_topic'] = 'Следующие темы ожидают одобрения:';
$txt['scheduled_approval_email_msg'] = 'Следующие сообщения ожидают сообщения:';

$txt['emailtemplate_resend_activate_message'] = array(
	'desc' => 'Письмо, отправляемое пользователю после регистрации, когда он должен пройти активацию через электропочту.',
	'subject' => 'Добро пожаловать на форум {FORUMNAME}',
	'body' => 'Спасибо за регистрацию на форуме {FORUMNAME}. Ваше имя пользователя {USERNAME}. Если забыли свой пароль, можете восстановить его по этой ссылке => {FORGOTPASSWORDLINK}.

Для активации своей учётной записи, пожалуйста, перейдите по ссылке:

{ACTIVATIONLINK}

При возникновении каких-либо проблем с активацией перейдите на страницу {ACTIVATIONLINKWITHOUTCODE} и введите код
"{ACTIVATIONCODE}".

{REGARDS}',
);

$txt['emailtemplate_mc_group_approve'] = array(
	'desc' => 'Письмо, отправляемое пользователю при получении положительного решения на запрос о вступлении в группу.',
	'subject' => 'Утверждение членства в группе',
	'body' => '{REALNAME},

Ваш запрос на вступление в группу "{GROUPNAME}" на форуме {FORUMNAME} одобрен. Ваша учётная запись обновлена.

{REGARDS}',
);

$txt['emailtemplate_mc_group_reject'] = array(
	'desc' => 'Письмо, отправляемое пользователю при получении отрицательного решения на запрос о вступлении в группу.',
	'subject' => 'Отклонение членства в группе',
	'body' => '{REALNAME},

Ваш запрос на вступление в группу "{GROUPNAME}" на форуме {FORUMNAME} отклонен.

{REGARDS}',
);

$txt['emailtemplate_mc_group_reject_reason'] = array(
	'desc' => 'Письмо, отправляемое пользователю при получении отрицательного решения на запрос о вступлении в группу, с указанием причины отказа.',
	'subject' => 'Отклонение членства в группе',
	'body' => '{REALNAME},

Ваш запрос на вступление в группу "{GROUPNAME}" на форуме {FORUMNAME} отклонен.

Это связано со следующей причиной: {REFUSEREASON}

{REGARDS}',
);

$txt['emailtemplate_admin_approve_accept'] = array(
	'desc' => 'Письмо, отправляемое пользователю после ручной активации его учётной записи администратором.',
	'subject' => 'Добро пожаловать на форум {FORUMNAME}',
	'body' => 'Добро пожаловать, {REALNAME}!

Ваша учётная запись была активирована, теперь можно пользоваться форумом. Ваше имя пользователя: {USERNAME}. Если забыли свой пароль, можете изменить его {FORGOTPASSWORDLINK}.

{REGARDS}',
);

$txt['emailtemplate_admin_approve_activation'] = array(
	'desc' => 'Письмо, отправляемое пользователю после одобрения его учётной записи администратором.',
	'subject' => 'Добро пожаловать на форум {FORUMNAME}',
	'body' => 'Добро пожаловать, {REALNAME}!

Ваша учётная запись на {FORUMNAME} была одобрена, теперь её нужно активировать. Для активации, пожалуйста, перейдите по ссылке:
{ACTIVATIONLINK}

При возникновении каких-либо проблем с активацией перейдите на страницу {ACTIVATIONLINKWITHOUTCODE} и введите код
{ACTIVATIONCODE}

{REGARDS}',
);

$txt['emailtemplate_admin_approve_reject'] = array(
	'desc' => 'Письмо, отправляемое пользователю после регистрации, одобрения администратором и последующего отказа в регистрации.',
	'subject' => 'Регистрация отклонена',
	'body' => '{USERNAME},

К сожалению, Вам отказано в регистрации на форуме {FORUMNAME}.

{REGARDS}',
);

$txt['emailtemplate_admin_approve_delete'] = array(
	'desc' => 'Письмо, отправляемое пользователю после удаления его учётной записи.',
	'subject' => 'Учётная запись удалена',
	'body' => '{USERNAME},

Ваша учётная запись на форуме {FORUMNAME} была удалена. Возможная причина: учётная запись так и не была активирована. Но можно зарегистрироваться снова.

{REGARDS}',
);

$txt['emailtemplate_admin_approve_remind'] = array(
	'desc' => 'Письмо, отправляемое пользователю, прошедшему регистрацию, но не активировавшему свою учётную запись.',
	'subject' => 'Напоминание о регистрации',
	'body' => '{REALNAME},

Вы до сих пор не активировали свою учётную запись на форуме {FORUMNAME}.

Для активации, пожалуйста, перейдите по ссылке:
{ACTIVATIONLINK}

При возникновении каких-либо проблем с активацией перейдите на страницу {ACTIVATIONLINKWITHOUTCODE} и введите код
{ACTIVATIONCODE}

{REGARDS}',
);

$txt['emailtemplate_admin_register_activate'] = array(
	'desc' => 'Письмо, отправляемое пользователю, зарегистрированному вручную через админку (требуется активация через e-mail).',
	'subject' => 'Добро пожаловать на форум {FORUMNAME}',
	'body' => 'Спасибо за регистрацию на форуме {FORUMNAME}. Ваше имя пользователя: {USERNAME}, пароль: {PASSWORD}.

Теперь необходимо активировать свою учётную запись. Пожалуйста, перейдите по ссылке:
{ACTIVATIONLINK}

При возникновении каких-либо проблем с активацией перейдите на страницу {ACTIVATIONLINKWITHOUTCODE} и введите код
{ACTIVATIONCODE}

{REGARDS}',
);

$txt['emailtemplate_admin_register_immediate'] = array(
	'desc' => 'Письмо, отправляемое пользователю, зарегистрированному вручную через админку (никаких дополнительных действий не требуется).',
	'subject' => 'Добро пожаловать на форум {FORUMNAME}',
	'body' => 'Спасибо за регистрацию на форуме {FORUMNAME}. Ваше имя пользователя: {USERNAME}, пароль: {PASSWORD}.

Для перехода на форум {FORUMNAME} воспользуйтесь ссылкой:
{SCRIPTURL}

{REGARDS}',
);

$txt['emailtemplate_new_announcement'] = array(
	'desc' => 'Письмо, используемое для объявлений, создаваемых администраторами и модераторами.',
	'subject' => 'Новое объявление: {TOPICSUBJECT}',
	'body' => '{MESSAGE}

Чтобы не получать такие объявления, пожалуйста, войдите на форум и снимите галочку с пункта "Получать рассылки, объявления и важные уведомления форума на e-mail" в своем профиле.

Полный текст объявления можно просмотреть, пройдя по этой ссылке:
{TOPICLINK}

{REGARDS}',
);

$txt['emailtemplate_notify_boards_once_body'] = array(
	'desc' => 'Письмо, отправляемое пользователю при появлении новой темы в разделе, на который оформлена подписка, включая содержание темы (новых уведомлений не будет, пока пользователь не зайдет на форум и не прочитает тему).',
	'subject' => 'Новая тема: {TOPICSUBJECT}',
	'body' => 'В разделе, на который Вы подписаны, была создана новая тема  \'{TOPICSUBJECT}\'.

Для просмотра темы перейдите по ссылке:
{TOPICLINK}

В разделе может быть создано много новых тем, но Вы не будете получать о них уведомления до тех пор, пока не посетите этот раздел и не прочитаете какие-нибудь из них.

Содержание темы:
{MESSAGE}

Чтобы отписаться от уведомлений о новых темах в этом разделе, нажмите сюда:
{UNSUBSCRIBELINK}

{REGARDS}',
);

$txt['emailtemplate_notify_boards_once'] = array(
	'desc' => 'Письмо, отправляемое пользователю при появлении новой темы в разделе, на который оформлена подписка (новых уведомлений не будет, пока пользователь не зайдет на форум и не прочитает тему).',
	'subject' => 'Новая тема: {TOPICSUBJECT}',
	'body' => 'В разделе, на который Вы подписаны, была создана новая тема  \'{TOPICSUBJECT}\'.

Для просмотра темы перейдите по ссылке:
{TOPICLINK}

В разделе может быть создано много новых тем, но Вы не будете получать о них уведомления до тех пор, пока не посетите этот раздел и не прочитаете какие-нибудь из них.

Чтобы отписаться от уведомлений о новых темах в этом разделе, нажмите сюда:
{UNSUBSCRIBELINK}

{REGARDS}',
);

$txt['emailtemplate_notify_boards_body'] = array(
	'desc' => 'Письмо, отправляемое пользователю при появлении новых тем в разделе, на который оформлена подписка, включая содержание этих тем.',
	'subject' => 'Новая тема: {TOPICSUBJECT}',
	'body' => 'В разделе, на который Вы подписаны, была создана новая тема  \'{TOPICSUBJECT}\'.

Для просмотра темы перейдите по ссылке
{TOPICLINK}

В разделе может быть создано много новых тем, но Вы не будете получать о них уведомления до тех пор, пока не посетите этот раздел и не прочитаете какие-нибудь из них.

Содержание темы:
{MESSAGE}

Чтобы отписаться от уведомлений о новых темах в этом разделе, нажмите сюда:
{UNSUBSCRIBELINK}

{REGARDS}',
);

$txt['emailtemplate_notify_boards'] = array(
	'desc' => 'Письмо, отправляемое пользователю при появлении новых тем в разделе, на который оформлена подписка.',
	'subject' => 'Новая тема: {TOPICSUBJECT}',
	'body' => 'В разделе, на который Вы подписаны, была создана новая тема  \'{TOPICSUBJECT}\'.

Для просмотра темы перейдите по ссылке
{TOPICLINK}

В разделе может быть создано много новых тем, но Вы не будете получать о них уведомления до тех пор, пока не посетите этот раздел и не прочитаете какие-нибудь из них.

Чтобы отписаться от уведомлений о новых темах в этом разделе, нажмите сюда:
{UNSUBSCRIBELINK}

{REGARDS}',
);

$txt['emailtemplate_request_membership'] = array(
	'desc' => 'Письмо, отправляемое модераторам, когда пользователь подает запрос на присоединение к другой группе.',
	'subject' => 'Запрос на вступление в группу',
	'body' => '{RECPNAME}, пользователь {APPYNAME} послал запрос на вступление в группу "{GROUPNAME}".

Указаны следующие причины для вступления в группу:
{REASON}

Перейдите по ссылке, чтобы отклонить или принять данный запрос:
{MODLINK}

{REGARDS}',
);

$txt['emailtemplate_paid_subscription_reminder'] = array(
	'desc' => 'Письмо, отправляемое пользователю, когда срок действия платной подписки истекает.',
	'subject' => 'Заканчивается платная подписка на форуме {FORUMNAME}',
	'body' => '{REALNAME}, срок вашей платной подписки на {FORUMNAME} заканчивается.
	
Если при оплате подписки было включено автопродление, то не требуется выполнять никаких действий, в противном случае можно заказать подписку заново. Детали указаны ниже:

Название подписки: {SUBSCRIPTION}
Заканчивается: {END_DATE}

Пройдите по ссылке, чтобы изменить свои подписки:
{PROFILELINKSUBS}

{REGARDS}',
);

$txt['emailtemplate_activate_reactivate'] = array(
	'desc' => 'Письмо, отправляемое пользователю, изменившему свой адрес электропочты.',
	'subject' => 'Добро пожаловать на форум {FORUMNAME}',
	'body' => 'Для перепроверки электронного адреса ваша учётная запись была деактивирована.
	
Для повторной активации, пожалуйста, пройдите по ссылке:
{ACTIVATIONLINK}

При возникновении каких-либо проблем с активацией перейдите на страницу {ACTIVATIONLINKWITHOUTCODE} и введите код
{ACTIVATIONCODE}

{REGARDS}',
);

$txt['emailtemplate_forgot_password'] = array(
	'desc' => 'Письмо, отправляемое пользователю, воспользовавшемуся функцией восстановления пароля.',
	'subject' => 'Новый пароль для форума {FORUMNAME}',
	'body' => 'Уважаемый пользователь, вы воспользовались функцией "восстановления пароля" для своей учётной записи.
	
Для установки нового пароля перейдите по ссылке:
{REMINDLINK}

IP: {IP}
Имя пользователя: {USERNAME}

{REGARDS}',
);

$txt['emailtemplate_scheduled_approval'] = array(
	'desc' => 'Письмо, отправляемое модераторам, с перечислением всех элементов, ожидающих одобрения.',
	'subject' => 'Опубликованные сообщения ожидают одобрения на форуме {FORUMNAME}',
	'body' => '{REALNAME}, это письмо содержит список всех элементов, ожидающих одобрения на форуме {FORUMNAME}.

{MESSAGE}

Пожалуйста, войдите на форум для просмотра данных элементов.
{SCRIPTURL}

{REGARDS}',
);

$txt['emailtemplate_send_topic'] = array(
	'desc' => 'Письмо, отправляемое адресатам при использовании функции "Поделиться темой" для поощрения обмена ссылками.',
	'subject' => 'Тема: {TOPICSUBJECT} (Отправитель: {SENDERNAMEMANUAL})',
	'body' => 'Здравствуйте, {RECPNAMEMANUAL}.

Предлагаю ознакомиться с темой "{TOPICSUBJECT}" на {FORUMNAME}.

Для просмотра перейдите по ссылке:
{TOPICLINK}

Спасибо,

{SENDERNAMEMANUAL}',
);

$txt['emailtemplate_send_topic_comment'] = array(
	'desc' => 'Письмо, отправляемое адресатам при использовании функции "Поделиться темой" с добавлением комментария.',
	'subject' => 'Тема: {TOPICSUBJECT} (Отправитель: {SENDERNAMEMANUAL})',
	'body' => 'Здравствуйте, {RECPNAMEMANUAL}.

Предлагаю ознакомиться с темой "{TOPICSUBJECT}" на {FORUMNAME}.

Для просмотра перейдите по ссылке:
{TOPICLINK}

Также к данной теме был добавлен комментарий:
{COMMENT}

Спасибо,

{SENDERNAMEMANUAL}',
);

$txt['emailtemplate_send_email'] = array(
	'desc' => 'Заглушка для функции "Отправить e-mail".',
	'subject' => '{EMAILSUBJECT}',
	'body' => '{EMAILBODY}',
);

$txt['emailtemplate_report_to_moderator'] = array(
	'desc' => 'Письмо, отправляемое модераторам, когда жалуются на какое-либо сообщение.',
	'subject' => 'Уведомление о сообщении: {TOPICSUBJECT} от {POSTERNAME}',
	'body' => '{REPORTERNAME} сообщил Вам об ответе, который, возможно, необходимо отредактировать:
"{TOPICSUBJECT}" от {POSTERNAME}.

Вы получили это уведомление, так как являетесь модератором раздела.

Тема: {TOPICLINK}
Центр модерации: {REPORTLINK}

Пользователь оставил следующий комментарий:
{COMMENT}

{REGARDS}',
);

$txt['emailtemplate_change_password'] = array(
	'desc' => 'Письмо, отправляемое пользователю при изменении пароля (включая информацию о новом пароле).',
	'subject' => 'Информация о новом пароле',
	'body' => 'Здравствуйте, {REALNAME}!

Информация для входа на {FORUMNAME} была изменена и пароль сброшен. Ниже приведена новая информация для входа.

Ваше имя пользователя: "{USERNAME}", пароль: "{PASSWORD}".

Пароль можно изменить в настройках своего профиля, посетив эту страницу после входа:
{SCRIPTURL}?action=profile

{REGARDS}',
);

$txt['emailtemplate_register_activate'] = array(
	'desc' => 'Письмо, отправляемое пользователю после регистрации (если требуется активация электронного адреса).',
	'subject' => 'Добро пожаловать на форум {FORUMNAME}',
	'body' => 'Спасибо за регистрацию на форуме {FORUMNAME}. Ваше имя пользователя {USERNAME}. Если забыли свой пароль, можете восстановить его, посетив {FORGOTPASSWORDLINK}.

Но сначала необходимо активировать свою учётную запись. Для этого, пожалуйста, перейдите по ссылке:
{ACTIVATIONLINK}

При возникновении каких-либо проблем с активацией перейдите на страницу {ACTIVATIONLINKWITHOUTCODE} и введите код
{ACTIVATIONCODE}

{REGARDS}',
);

$txt['emailtemplate_register_activate_approve'] = array(
	'desc' => 'Письмо, отправляемое пользователю для активации учётной записи (когда администратор одобряет аккаунты вручную).',
	'subject' => 'Добро пожаловать на форум {FORUMNAME}',
	'body' => 'Спасибо за регистрацию на форуме {FORUMNAME}. Ваше имя пользователя {USERNAME}. Если забыли свой пароль, можете восстановить его, посетив {FORGOTPASSWORDLINK}.

Но сначала необходимо активировать свою учётную запись. Для этого, пожалуйста, перейдите по ссылке:
{ACTIVATIONLINK}

При возникновении каких-либо проблем с активацией перейдите на страницу {ACTIVATIONLINKWITHOUTCODE} и введите код
{ACTIVATIONCODE}

После активации учётной записи администратор примет решение, принять или отклонить ваш аккаунт. О результатах Вам будет сообщено в ответном письме.

{REGARDS}',
);

$txt['emailtemplate_register_coppa'] = array(
	'desc' => 'Письмо, отправляемое пользователю после регистрации, когда требуется заполнить форму COPPA (для доступа к форуму требуется согласие родителей).',
	'subject' => 'Добро пожаловать на форум {FORUMNAME}',
	'body' => 'Спасибо за регистрацию на форуме {FORUMNAME}. Ваше имя пользователя: {USERNAME}. Если забыли свой пароль, можете восстановить его, посетив {FORGOTPASSWORDLINK}.

Перед тем как сможете войти, администрации требуется разрешение ваших родителей/опекунов для регистрации на форуме. Дополнительную информацию можно получить, перейдя по ссылке:

{COPPALINK}

{REGARDS}',
);

$txt['emailtemplate_register_immediate'] = array(
	'desc' => 'Письмо, отправляемое пользователю после регистрации (когда настроена мгновенная регистрация).',
	'subject' => 'Добро пожаловать на форум {FORUMNAME}',
	'body' => 'Спасибо за регистрацию на форуме {FORUMNAME}.

Ваше имя пользователя: {USERNAME}. Если забыли свой пароль, можете восстановить его, посетив {FORGOTPASSWORDLINK}.

{REGARDS}',
);

$txt['emailtemplate_register_pending'] = array(
	'desc' => 'Письмо, отправляемое пользователю после регистрации (когда учётная запись ожидает одобрения администратором).',
	'subject' => 'Добро пожаловать на форум {FORUMNAME}',
	'body' => 'Ваш запрос о регистрации на форуме {FORUMNAME} принят, {REALNAME}.

Ваше имя пользователя: {USERNAME}. Если забыли свой пароль, можете восстановить его, посетив {FORGOTPASSWORDLINK}.

Подождите, пока ваш запрос одобрят. Когда это произойдет, придет другое письмо с данного адреса, и Вы сможете войти на форум.

{REGARDS}',
);

$txt['emailtemplate_notification_reply'] = array(
	'desc' => 'Письмо, отправляемое пользователю при появлении нового сообщения в теме, на которую он подписан.',
	'subject' => 'Ответ в теме: {TOPICSUBJECT}',
	'body' => 'Появился ответ от {POSTERNAME} в теме, на которую Вы подписаны.

Прочитать ответ: {TOPICLINK}

Чтобы отказаться от уведомлений, нажмите сюда: {UNSUBSCRIBELINK}

{REGARDS}',
);

$txt['emailtemplate_notification_reply_body'] = array(
	'desc' => 'Письмо, отправляемое пользователю при появлении нового сообщения в теме, на которую он подписан (содержание сообщения прилагается).',
	'subject' => 'Ответ в теме: {TOPICSUBJECT}',
	'body' => 'Появился ответ от {POSTERNAME} в теме, на которую Вы подписаны.

Прочитать ответ: {TOPICLINK}

Чтобы отказаться от уведомлений, нажмите сюда: {UNSUBSCRIBELINK}

Содержание ответа:
{MESSAGE}

{REGARDS}',
);

$txt['emailtemplate_notification_reply_once'] = array(
	'desc' => 'Письмо, отправляемое пользователю при появлении самого первого нового сообщения в теме, на которую оформлена подписка.',
	'subject' => 'Ответ в теме: {TOPICSUBJECT}',
	'body' => 'Появился ответ от {POSTERNAME} в теме, на которую Вы подписаны.

Прочитать ответ: {TOPICLINK}

Чтобы отказаться от уведомлений, нажмите сюда: {UNSUBSCRIBELINK}

В теме может быть оставлено много новых ответов, но уведомления о них не будут поступать, пока Вы не просмотрите сообщение, о котором уже были уведомлены.

{REGARDS}',
);

$txt['emailtemplate_notification_reply_body_once'] = array(
	'desc' => 'Письмо, отправляемое пользователю при появлении самого первого нового сообщения в теме, на которую оформлена подписка (содержание этого сообщения прилагается).',
	'subject' => 'Ответ в теме: {TOPICSUBJECT}',
	'body' => 'Появился ответ от {POSTERNAME} в теме, на которую Вы подписаны.

Прочитать ответ: {TOPICLINK}

Чтобы отказаться от уведомлений, нажмите сюда: {UNSUBSCRIBELINK}

Содержание ответа:
{MESSAGE}

В теме может быть оставлено много новых ответов, но уведомления о них не будут поступать, пока Вы не просмотрите сообщение, о котором уже были уведомлены.

{REGARDS}',
);

$txt['emailtemplate_notification_pin'] = array(
	'desc' => 'Письмо, отправляемое пользователю, если одна из тем, на которую он подписан, закрепляется или открепляется.',
	'subject' => 'Тема прикреплена: {TOPICSUBJECT}',
	'body' => 'Тема, на которую Вы подписаны, была прикреплена пользователем {POSTERNAME}.

Просмотреть тему: {TOPICLINK}

Чтобы отказаться от уведомлений, нажмите сюда: {UNSUBSCRIBELINK}

{REGARDS}',
);

$txt['emailtemplate_notification_lock'] = array(
	'desc' => 'Письмо, отправляемое пользователю, если одна из тем, на которую он подписан, блокируется.',
	'subject' => 'Тема заблокирована: {TOPICSUBJECT}',
	'body' => 'Тема, на которую Вы подписаны, была заблокирована пользователем {POSTERNAME}.

Просмотреть тему: {TOPICLINK}

Чтобы отказаться от уведомлений, нажмите сюда: {UNSUBSCRIBELINK}

{REGARDS}',
);

$txt['emailtemplate_notification_unlock'] = array(
	'desc' => 'Письмо, отправляемое пользователю, если одна из тем, на которую он подписан, разблокируется.',
	'subject' => 'Тема разблокирована: {TOPICSUBJECT}',
	'body' => 'Тема, на которую Вы подписаны, была разблокирована пользователем {POSTERNAME}.

Просмотреть тему: {TOPICLINK}

Чтобы отказаться от уведомлений, нажмите сюда: {UNSUBSCRIBELINK}

{REGARDS}',
);

$txt['emailtemplate_notification_remove'] = array(
	'desc' => 'Письмо, отправляемое пользователю, если одна из тем, на которую он подписан, удалена.',
	'subject' => 'Тема удалена: {TOPICSUBJECT}',
	'body' => 'Тема, на которую Вы подписаны, была удалена пользователем {POSTERNAME}.

{REGARDS}',
);

$txt['emailtemplate_notification_move'] = array(
	'desc' => 'Письмо, отправляемое пользователю, если одна из тем, на которую он подписан, перемещена в другое место.',
	'subject' => 'Тема перемещена: {TOPICSUBJECT}',
	'body' => 'Тема, на которую Вы подписаны, была перемещена пользователем {POSTERNAME}.

Просмотреть тему: {TOPICLINK}

Чтобы отказаться от уведомлений, нажмите сюда: {UNSUBSCRIBELINK}

{REGARDS}',
);

$txt['emailtemplate_notification_merge'] = array(
	'desc' => 'Письмо, отправляемое пользователю, если одна из тем, на которую он подписан, объединена с другой.',
	'subject' => 'Тема объединена: {TOPICSUBJECT}',
	'body' => 'Тема, на которую Вы подписаны, была объединена с другой темой пользователем {POSTERNAME}.

Просмотреть новую тему: {TOPICLINK}

Чтобы отказаться от уведомлений, нажмите сюда: {UNSUBSCRIBELINK}

{REGARDS}',
);

$txt['emailtemplate_notification_split'] = array(
	'desc' => 'Письмо, отправляемое пользователю, если одна из тем, на которую он подписан, разделена на несколько частей.',
	'subject' => 'Тема разделена: {TOPICSUBJECT}',
	'body' => 'Тема, на которую Вы подписаны, была разделена на две или более пользователем {POSTERNAME}.

Просмотреть остаток темы: {TOPICLINK}

Чтобы отказаться от уведомлений, нажмите сюда: {UNSUBSCRIBELINK}

{REGARDS}',
);

$txt['emailtemplate_admin_notify'] = array(
	'desc' => 'Письмо, отправляемое администраторам при регистрации новых пользователей.',
	'subject' => 'Зарегистрирован новый пользователь',
	'body' => 'На вашем форуме зарегистрирован новый пользователь: {USERNAME}.
	
Нажмите на ссылку, чтобы просмотреть его профиль:
{PROFILELINK}

{REGARDS}',
);

$txt['emailtemplate_admin_notify_approval'] = array(
	'desc' => 'Письмо, отправляемое администраторам при регистрации новых пользователей (требуется одобрение учётной записи).',
	'subject' => 'Зарегистрирован новый пользователь',
	'body' => 'На вашем форуме зарегистрирован новый пользователь: {USERNAME}.
	
Нажмите на ссылку, чтобы просмотреть его профиль:
{PROFILELINK}

Прежде чем пользователь сможет отправлять сообщения, учётная запись должна быть одобрена. Для этого нажмите на ссылку:
{APPROVALLINK}

{REGARDS}',
);

$txt['emailtemplate_admin_attachments_full'] = array(
	'desc' => 'Письмо, отправляемое администраторам при достижении установленного в настройках лимита размера папки вложений.',
	'subject' => 'Срочно! Папка вложений почти заполнена',
	'body' => '{REALNAME}, папка вложений на форуме {FORUMNAME} почти заполнена. Пожалуйста, посетите форум и решите эту проблему.

Когда размер папки вложений достигнет максимально разрешенного, пользователи не смогут присоединять вложения к сообщениям и загружать аватары (если разрешено).

{REGARDS}',
);

$txt['emailtemplate_paid_subscription_refund'] = array(
	'desc' => 'Письмо, отправляемое администраторам с сообщением о продлении платной подписки.',
	'subject' => 'Продлена платная подписка',
	'body' => '{REALNAME}, пользователь прислал продление платной подписки. Ниже указаны детали этой подписки:

	Название подписки: {SUBSCRNAME}
	Имя пользователя: {REFUNDNAME} ({REFUNDUSER})
	Дата: {DATE}

Для просмотра профиля пользователя перейдите по ссылке:
{PROFILELINK}

{REGARDS}',
);

$txt['emailtemplate_paid_subscription_new'] = array(
	'desc' => 'Письмо, отправляемое администраторам с сообщением о новой платной подписке.',
	'subject' => 'Новая платная подписка',
	'body' => '{REALNAME},

Пользователь заказал новую платную подписку. Ниже указаны детали этой подписки:

	Название подписки: {SUBSCRNAME}
	Имя пользователя: {SUBNAME} ({SUBUSER})
	E-mail: {SUBEMAIL}
	Цена: {PRICE}
	Дата: {DATE}

Для просмотра профиля пользователя перейдите по ссылке:
{PROFILELINK}

{REGARDS}',
);

$txt['emailtemplate_paid_subscription_error'] = array(
	'desc' => 'Письмо, отправляемое администраторам с сообщением о возникшей ошибке во время обработки платной подписки.',
	'subject' => 'Произошла ошибка платной подписки',
	'body' => '{REALNAME},

При обработке платной подписки возникла следующая ошибка
----------------------------------------------------------------
{SUBERROR}

{REGARDS}',
);

$txt['emailtemplate_pm_email'] = array(
	'desc' => 'Шаблон, используемый для отправки уведомлений о личных сообщениях.',
	'subject' => 'Новое личное сообщение: {SUBJECT}',
	'body' => 'Вы получили личное сообщение от пользователя {SENDERNAME} на форуме {FORUMNAME}.

ВАЖНО: Помните, что это только уведомление. Пожалуйста, не отвечайте на это письмо.

Текст сообщения:
{MESSAGE}

Ответить на это сообщение: {REPLYLINK}',
);
