<?php
// Version: 2.0; Errors

$txt['no_access'] = 'Вы не можете зайти в этот раздел.';
$txt['moved_no_access'] = 'Эта тема перемещена в раздел, к которому у вас нет доступа.';

$txt['no_name'] = 'Поле <strong>Имя</strong> обязательно для заполнения.';
$txt['no_email'] = 'Поле <strong>Email</strong> обязательно для заполнения.';
$txt['topic_locked'] = 'Эта тема заблокирована, посылать или изменять сообщения нельзя...';
$txt['no_password'] = 'Введите пароль';
$txt['already_a_user'] = 'Указанное имя пользователя уже используется на форуме.';
$txt['cant_move'] = 'Вы не можете перемещать темы...';
$txt['passwords_dont_match'] = 'Пароли не совпадают.';
$txt['register_to_use'] = 'Извините, перед тем, как использовать эти настройки, необходимо зарегистрироваться.';
$txt['password_invalid_character'] = 'Использован недопустимый символ в пароле.';
$txt['name_invalid_character'] = 'Использован недопустимый символ в имени.';
$txt['email_invalid_character'] = 'Использован недопустимый символ в e-mail.';
$txt['username_reserved'] = 'Указанное имя пользователя зарезервировано \'%1$s\'. Пожалуйста, выберите другое имя.';
$txt['numbers_one_to_nine'] = 'В этом поле можно указывать только числа от 0 до 9';
$txt['not_a_user'] = 'Пользователя не существует.';
$txt['not_a_topic'] = 'Темы не существует.';
$txt['not_approved_topic'] = 'Эта тема еще не одобрена.';
$txt['email_in_use'] = 'Данный e-mail (%1$s) уже используется другим пользователем. Если думаете, что это ошибка, воспользуйтесь опцией напоминания пароля на странице входа.';
$txt['no_pinned_order'] = 'В этом разделе нет закрепленных тем, чтобы их упорядочить.';

$txt['didnt_select_vote'] = 'Вы не выбрали пункт голосования.';
$txt['poll_error'] = 'Голосование не существует или закрыто, либо вы пытаетесь проголосовать дважды.';
$txt['members_only'] = 'Доступно только зарегистрированным пользователям.';
$txt['locked_by_admin'] = 'Было закрыто администратором. Не удается открыть.';
$txt['feature_disabled'] = 'Извините, эта опция отключена.';
$txt['cant_access_upload_path'] = 'Нет доступа к папке для загрузки вложений!';
$txt['file_too_big'] = 'Файл слишком большой. Максимальный размер вложения должен быть не более %1$d КБ.';
$txt['attach_timeout'] = 'Вложение не может быть сохранено. Возможно, файл больше, чем позволяет сервер.<br><br>Пожалуйста, проконсультируйтесь с администратором для получения более подробной информации.';
$txt['filename_exists'] = 'Извините! Уже существует вложение с таким же именем файла, как у загружаемого. Пожалуйста, переименуйте файл и повторите попытку.';
$txt['bad_attachment'] = 'Вложение не прошло проверку безопасности и не может быть загружено. Пожалуйста, обратитесь к администратору форума.';
$txt['ran_out_of_space'] = 'Папка для загрузки вложений заполнена. Попробуйте файл меньшего размера или свяжитесь с администратором.';
$txt['no_board'] = 'Указанный раздел не существует';
$txt['cant_split'] = 'Вы не можете разделять темы';
$txt['cant_merge'] = 'Вы не можете соединять темы';
$txt['no_topic_id'] = 'Вы указали неправильный ID темы.';
$txt['split_first_post'] = 'Вы не можете разделять тему с первого сообщения.';
$txt['topic_one_post'] = 'Эта тема содержит только одно сообщение и не может быть разделена.';
$txt['no_posts_selected'] = 'Не выбраны сообщения';
$txt['selected_all_posts'] = 'Невозможно разделить тему. Вы выбрали все сообщения.';
$txt['cant_find_messages'] = 'Невозможно найти сообщения';
$txt['cant_find_user_email'] = 'Невозможно найти пользователя с таким e-mail.';
$txt['cant_insert_topic'] = 'Невозможно вставить тему';
$txt['already_a_mod'] = 'Вы выбрали имя пользователя, совпадающее с именем существующего модератора. Пожалуйста, выберите другое имя.';
$txt['session_timeout'] = 'Ваша сессия закончилась, пока вы писали сообщение. Пожалуйста, вернитесь назад и попробуйте снова.';
$txt['session_verify_fail'] = 'Не удалось проверить сессию. Пожалуйста, выйдите из форума и зайдите снова.';
$txt['verify_url_fail'] = 'Невозможно проверить месторасположение отсылаемого файла. Пожалуйста, вернитесь назад и попробуйте снова.';
$txt['guest_vote_disabled'] = 'Гости не могут участвовать в этом голосовании.';

$txt['cannot_access_mod_center'] = 'Вы не обладаете правами доступа в центр модерации.';
$txt['cannot_admin_forum'] = 'Вы не можете администрировать этот форум.';
$txt['cannot_announce_topic'] = 'Вы не можете извещать о темах в этом разделе.';
$txt['cannot_approve_posts'] = 'У вас нет прав доступа для одобрения данного элемента.';
$txt['cannot_remove_any'] = 'Вы не можете удалять любые сообщения. Убедитесь, что эта тема не была перемещена в другой раздел.';
$txt['cannot_remove_own'] = 'Вы не можете удалять свои сообщения. Убедитесь, что эта тема не была перемещена в другой раздел.';
$txt['cannot_edit_news'] = 'Вы не можете редактировать новости на этом форуме.';
$txt['cannot_pm_read'] = 'Извините, нельзя читать личные сообщения.';
$txt['cannot_pm_send'] = 'Извините, нельзя отправлять личные сообщения.';
$txt['cannot_lock_any'] = 'Вы не можете закрывать темы.';
$txt['cannot_lock_own'] = 'Извините, нельзя закрывать собственные темы.';
$txt['cannot_pin_topic'] = 'Вы не можете прикрепить эту тему.';
$txt['cannot_manage_attachments'] = 'Вам не разрешается управлять вложениями или аватарами.';
$txt['cannot_manage_bans'] = 'Вы не можете изменять список забаненных пользователей.';
$txt['cannot_manage_boards'] = 'Вам не позволено управлять разделами и категориями.';
$txt['cannot_manage_membergroups'] = 'Не хватает прав для изменения или добавления групп пользователей.';
$txt['cannot_manage_permissions'] = 'Не хватает прав для управления правами пользователей.';
$txt['cannot_manage_smileys'] = 'Вы не можете управлять смайлами и иконками сообщений.';
$txt['cannot_mark_any_notify'] = 'У вас нет необходимого разрешения получать уведомления из этой темы.';
$txt['cannot_mark_notify'] = 'Извините, нельзя получать уведомления из этого раздела.';
$txt['cannot_merge_any'] = 'Вы не можете соединять темы в этом разделе.';
$txt['cannot_merge_moved'] = 'Вы не можете соединять уведомления "тема перемещена".';
$txt['cannot_moderate_forum'] = 'Вы не можете модерировать этот форум.';
$txt['cannot_moderate_board'] = 'Вам не разрешена модерация этого раздела.';
$txt['cannot_modify_any'] = 'Вы не можете изменять любые сообщения.';
$txt['cannot_modify_own'] = 'Извините, нельзя редактировать собственные сообщения.';
$txt['cannot_modify_replies'] = 'Вы не можете редактировать сообщения, даже если являетесь автором.';
$txt['cannot_modify_mod_post'] = 'Извините, но вам не разрешено редактировать сообщения, отредактированные модератором.';
$txt['cannot_move_own'] = 'Вы не можете перемещать собственные темы.';
$txt['cannot_move_any'] = 'Вы не можете перемещать темы в этом разделе.';
$txt['cannot_poll_add_own'] = 'Извините, нельзя добавлять голосование в собственную тему.';
$txt['cannot_poll_add_any'] = 'Извините, нельзя добавлять голосования в темы.';
$txt['cannot_poll_edit_own'] = 'Вы не можете редактировать голосование, даже если являетесь автором.';
$txt['cannot_poll_edit_any'] = 'Вы не можете редактировать голосования.';
$txt['cannot_poll_lock_own'] = 'Вы не можете закрывать свои голосования.';
$txt['cannot_poll_lock_any'] = 'Извините, нельзя закрывать голосования.';
$txt['cannot_poll_post'] = 'Вы не можете создавать голосования в этом разделе.';
$txt['cannot_poll_remove_own'] = 'Вы не можете удалить голосование из собственной темы.';
$txt['cannot_poll_remove_any'] = 'Вы не можете удалять голосования.';
$txt['cannot_poll_view'] = 'Вы не можете просматривать голосования в этом разделе.';
$txt['cannot_poll_vote'] = 'Извините, но нельзя голосовать в этом разделе.';
$txt['cannot_post_attachment'] = 'Вы не можете вставлять здесь вложения.';
$txt['cannot_post_new'] = 'Извините, но вам нельзя создавать новые темы в этом разделе.';
$txt['cannot_post_reply_any'] = 'Вы не можете отвечать в этом разделе.';
$txt['cannot_post_reply_own'] = 'Вы не можете отвечать в этом разделе, даже если являетесь автором темы.';
$txt['cannot_profile_remove_own'] = 'Извините, нельзя удалить свою учётную запись.';
$txt['cannot_profile_remove_any'] = 'Вы не можете удалять учётные записи пользователей!';
$txt['cannot_profile_extra_any'] = 'Вы не можете изменять настройки профиля.';
$txt['cannot_profile_identity_any'] = 'Вы не можете редактировать настройки учётной записи.';
$txt['cannot_profile_title_any'] = 'Вы не можете редактировать надпись над аватаром пользователей.';
$txt['cannot_profile_extra_own'] = 'Извините, редактировать данные в профиле запрещено.';
$txt['cannot_profile_identity_own'] = 'Извините, изменение информации запрещено.';
$txt['cannot_profile_title_own'] = 'Вы не можете изменить надпись над аватаром.';
$txt['cannot_profile_server_avatar'] = 'Вы не можете использовать аватары, расположенные на сервере.';
$txt['cannot_profile_upload_avatar'] = 'Вы не можете загружать аватары.';
$txt['cannot_profile_remote_avatar'] = 'Вы не можете использовать аватары с удаленного сервера.';
$txt['cannot_profile_view_own'] = 'Вы не можете просматривать свой профиль.';
$txt['cannot_profile_view_any'] = 'Вы не можете просматривать профили пользователей.';
$txt['cannot_delete_own'] = 'Вы не можете удалять собственные темы в этом разделе.';
$txt['cannot_delete_replies'] = 'Извините, нельзя удалять сообщения, даже если они находятся в вашей собственной теме.';
$txt['cannot_delete_any'] = 'Извините, удаление любых сообщений в этом разделе не разрешено.';
$txt['cannot_report_any'] = 'Вы не можете извещать о сообщениях в этом разделе.';
$txt['cannot_search_posts'] = 'Вы не можете искать сообщения на этом форуме.';
$txt['cannot_send_mail'] = 'У вас не хватает прав на отправку e-mail пользователям форума.';
$txt['cannot_issue_warning_self'] = 'Извините, вы не можете вынести предупреждение самому себе.';
$txt['cannot_issue_warning_these_groups'] = 'Извините, вы не можете вынести предупреждение данному пользователю.';
$txt['cannot_issue_warning_too_many'] = 'Извините, вы не можете вынести предупреждение данному пользователю, так как вынесли сегодня уже слишком много предупреждений.';
$txt['cannot_issue_warning'] = 'Извините, но у вас нет полномочий делать предупреждения.';
$txt['warning_not_found'] = 'Извините, запрошенное правонарушение не удалось обнаружить.';
$txt['cannot_revoke_warning'] = 'К сожалению, вы не сможете удалить это нарушение.';
$txt['cannot_revoke_warning_self'] = 'К сожалению, вам не разрешено удалять собственные нарушения.';
$txt['cannot_revoke_already_revoked'] = 'К сожалению, вы не можете удалить это нарушение, оно уже было удалено ранее.';
$txt['cannot_revoke_already_expired'] = 'К сожалению, вы не можете удалить это нарушение, оно уже истекло.';
$txt['cannot_send_topic'] = 'Извините, но администратор отключил создание тем в этом разделе.';
$txt['cannot_split_any'] = 'Разделение любых тем в этом разделе запрещено.';
$txt['cannot_view_attachments'] = 'Вам не позволено скачивать или просматривать вложения в этом разделе.';
$txt['cannot_view_mlist'] = 'Вы не можете просматривать список пользователей.';
$txt['cannot_view_stats'] = 'Вы не можете просматривать статистику форума.';
$txt['cannot_who_view'] = 'Вы не можете просматривать, кто онлайн.';
$txt['stats_not_available'] = 'Статистика форума недоступна.';

$txt['registration_disabled'] = 'Извините, регистрация в данный момент недоступна.';
$txt['registration_no_secret_question'] = 'Извините, для данного пользователя не выбран секретный вопрос.';
$txt['poll_range_error'] = 'Извините, опрос должен длиться минимум 1 день.';
$txt['delFirstPost'] = 'Вы не можете удалить первое сообщение в теме.<p>Если хотите удалить всю тему, нажмите на УДАЛИТЬ ТЕМУ или попросите администратора/модератора сделать это за вас.</p>';
$txt['parent_error'] = 'Не удалось создать раздел!';
$txt['login_cookie_error'] = 'Не удалось войти на форум. Пожалуйста, проверьте настройки cookie.';
$txt['incorrect_answer'] = 'Извините, вы неправильно ответили на секретный вопрос. Нажмите «Назад» и попробуйте снова, или нажмите «Назад» дважды, чтобы использовать обычный метод получения пароля.';
$txt['no_mods'] = 'Модераторы отсутствуют!';
$txt['parent_not_found'] = 'Структура раздела испорчена: не получилось найти родительский раздел';
$txt['modify_post_time_passed'] = 'Нельзя отредактировать это сообщение, поскольку время, отведенное на редактирование, истекло.';

$txt['missing_board_id'] = 'Не указан ID раздела.';
$txt['missing_topic_id'] = 'Не указан ID темы.';
$txt['topic_doesnt_exist'] = 'Такой темы не существует.';
$txt['not_your_topic'] = 'Вы не являетесь владельцем этой темы.';
$txt['board_doesnt_exist'] = 'Такого раздела не существует.';

$txt['moveto_noboards'] = 'Отсутствует раздел для перемещения туда темы!';

$txt['already_activated'] = 'Ваша учётная запись уже активирована.';
$txt['still_awaiting_approval'] = 'Ваша учётная запись ожидает одобрения администратора.';

$txt['invalid_tracking_ip'] = 'Неправильный IP или диапазон IP.<br>Пример правильного IP адреса: 127.0.0.1<br>Пример правильного диапазона IP адресов: 127.0.0.*';

$txt['recycle_no_valid_board'] = 'Не выбран действующий раздел для удаления темы';

$txt['login_threshold_fail'] = 'Извините, нельзя войти на форум. Пожалуйста, попробуйте позже.';
$txt['login_threshold_brute_fail'] = 'Извините, но вы уже превысили лимит попыток входа на форум. Пожалуйста, подождите 30 секунд и повторите попытку позже.';
$txt['under_age_registration_prohibited'] = 'Извините, но пользователям в возрасте до %1$d не разрешено регистрироваться на этом форуме.';

$txt['who_off'] = 'Вы не можете получить доступ к списку пользователей, находящихся онлайн. Данная функция отключена.';

$txt['unsupported_browser'] = 'Используемый вами браузер, %s, очень старый, медленный и небезопасный. Обновите его, либо перейдите на более современные альтернативы, такие как Google Chrome, Opera или Mozilla Firefox.';

$txt['merge_create_topic_failed'] = 'Ошибка при создании новой темы.';
$txt['merge_need_more_topics'] = 'Для соединения требуется как минимум две темы.';

$txt['postWaitTime_broken'] = 'Последнее сообщение с вашего IP адреса было сделано менее чем %1$d секунд назад. Пожалуйста, попробуйте позже.';
$txt['registerWaitTime_broken'] = 'Вы уже зарегистрировались %1$d секунд назад!';
$txt['loginWaitTime_broken'] = 'Вам придется подождать около %1$d секунд, чтобы повторить попытку входа, извините.';
$txt['pmWaitTime_broken'] = 'Последнее личное сообщение было отправлено с вашего IP адреса менее чем %1$d секунд назад. Пожалуйста, попробуйте позже.';
$txt['reporttmWaitTime_broken'] = 'Последний отчёт о сообщении был отправлен с вашего IP адреса менее чем %1$d секунд назад. Пожалуйста, попробуйте позже.';
$txt['sendtopcWaitTime_broken'] = 'Последняя тема был отправлена с вашего IP адреса менее чем %1$d секунд назад. Пожалуйста, попробуйте позже.';
$txt['sendmailWaitTime_broken'] = 'Последний e-mail отправлен с вашего IP адреса менее чем %1$d секунд назад. Пожалуйста, попробуйте позже.';
$txt['searchWaitTime_broken'] = 'Ваш последний запрос поиска был сделан менее %1$d секунд назад. Пожалуйста, попробуйте позже.';

$txt['email_missing_data'] = 'Вы должны ввести что-то в тему и тело сообщения.';

$txt['topic_gone'] = 'Тема или раздел, которую вы ищете, отсутствует или недоступна для входа.';
$txt['theme_edit_missing'] = 'Файл, который вы пытаетесь редактировать, не найден!';

$txt['attachments_no_write'] = 'Папка для вложений находится в режиме ТОЛЬКО ДЛЯ ЧТЕНИЯ. Вложения и аватары НЕ могут быть сохранены.';
$txt['attachments_limit_per_post'] = 'Вы не можете загружать более %1$d вложений в одном сообщении';

$txt['pm_not_yours'] = 'Личное сообщение, которое вы пытаетесь процитировать, не ваше или его не существует. Пожалуйста, вернитесь назад и попробуйте снова.';
$txt['mangled_post'] = 'Проблемы с датой, пожалуйста, вернитесь и попробуйте заново.';
$txt['quoted_post_deleted'] = 'Сообщение, которое вы пытаетесь процитировать, было удалено или больше недоступно.';
$txt['pm_too_many_per_hour'] = 'Вы исчерпали лимит отправки личных сообщений в %1$d за один час.';
$txt['labels_too_many'] = 'Извините, у вас уже %1$s сообщений в папке!';

$txt['register_only_once'] = 'Извините, но нельзя регистрировать сразу несколько пользователей за один раз.';
$txt['admin_setting_coppa_require_contact'] = 'Вы должны ввести свои контактные данные или номер факса для контакта с вашими родителями/опекунами (если требуется их одобрение).';

$txt['error_long_name'] = 'Имя, которое вы пытаетесь использовать, слишком длинное.';
$txt['error_no_name'] = 'Отсутствует имя.';
$txt['error_bad_name'] = 'Данное имя не может быть использовано. Оно зарезервировано на форуме.';
$txt['error_no_email'] = 'Отсутствует e-mail.';
$txt['error_bad_email'] = 'Неправильный e-mail.';
$txt['error_no_subject'] = 'Отсутствует тема сообщения.';
$txt['error_no_question'] = 'Отсутствует вопрос.';
$txt['error_no_message'] = 'Сообщение было оставлено пустым.';
$txt['error_long_message'] = 'Сообщение превышает максимально допустимую длину (%s знаков).';
$txt['error_no_comment'] = 'Текст комментария не введен.';
$txt['error_session_timeout'] = 'Ваша сессия истекла во время написания сообщения. Пожалуйста, попробуйте заново.';
$txt['error_not_permitted_content'] = 'Ваше сообщение не соответствует правилам форума.';
$txt['error_no_to'] = 'Отсутствуют получатели.';
$txt['error_bad_to'] = 'Получатели не найдены.';
$txt['error_bad_bcc'] = 'Получатели не найдены.';
$txt['error_form_already_submitted'] = 'Вы уже отправили это сообщение! Возможно, вы случайно нажали дважды или попытались обновить страницу.';
$txt['error_poll_few'] = 'Должно быть как минимум два пункта голосования!';
$txt['error_need_qr_verification'] = 'Пожалуйста, ответьте на проверочный вопрос внизу, чтобы получить возможность создать сообщение.';
$txt['error_wrong_verification_code'] = 'Набранные символы не совпадают с символами на изображении.';
$txt['error_wrong_verification_answer'] = 'Вы не правильно ответили на вопрос.';
$txt['error_need_verification_code'] = 'Пожалуйста, введите визуальный код проверки для получения результатов.';
$txt['error_bad_file'] = 'Извините, невозможно открыть файл: %1$s';
$txt['error_bad_line'] = 'Неправильно указана строка.';
$txt['error_too_quickly'] = 'Вы заполнили регистрационную форму слишком быстро, быстрее, чем обычно.<br><br><div class="smalltext">(Эй, роботам здесь не рады!)</div>';
$txt['error_subject_too_long'] = 'Заголовок слишком длинный. Максимальная длина составляет %d символов, а у вашего — %d.';

$txt['smiley_not_found'] = 'Смайл не найден.';
$txt['smiley_has_no_code'] = 'Этому смайлу не был присвоен код.';
$txt['smiley_has_no_filename'] = 'Не был назван файл этого смайла.';
$txt['smiley_not_unique'] = 'Смайл с таким кодом уже существует.';
$txt['smiley_set_already_exists'] = 'Набор смайлов с таким URL-адресом уже существует';
$txt['smiley_set_not_found'] = 'Набор смайлов не найден';
$txt['smiley_set_path_already_used'] = 'URL-адрес набора смайлов уже использовался другим набором смайлов.';
$txt['smiley_set_unable_to_import'] = 'Невозможно импортировать набор смайлов. Неверно указана директория, или к ней нет доступа.';

$txt['smileys_upload_error'] = 'Не удалось загрузить файлы.';
$txt['smileys_upload_error_blank'] = 'Все наборы смайлов должны иметь изображение!';
$txt['smileys_upload_error_name'] = 'Все смайлы должны иметь собственные имена!';
$txt['smileys_upload_error_illegal'] = 'Неверный тип.';

$txt['search_invalid_weights'] = 'Параметры поиска сконфигурированы неверно. Как минимум один фактор должен отличаться от нуля. Пожалуйста, сообщите об этой ошибке администратору..';
$txt['unable_to_create_temporary'] = 'Поиск не смог создать временную таблицу. Пожалуйста, сообщите об этой ошибке администратору.';

$txt['only_on_wedge'] = 'К сожалению, этот материал может быть загружен только с официального источника.';

$txt['no_membergroup_selected'] = 'Не выбрана группа пользователей';
$txt['membergroup_does_not_exist'] = 'Такой группы пользователей не существует.';

$txt['at_least_one_admin'] = 'На форуме должен быть как минимум один администратор!';

$txt['error_functionality_not_windows'] = 'Извините, эта возможность в данный момент не доступна для серверов работающих под управлением Windows.';

// Don't use entities in the below string.
$txt['attachment_not_found'] = 'Вложение не найдено';

$txt['error_no_boards_selected'] = 'Раздел не выбран!';
$txt['error_invalid_search_string'] = 'Вы не указали строку поиска';
$txt['error_invalid_search_string_blacklist'] = 'Ваш запрос состоит из слишком незначительных слов. Попробуйте снова с другими словами.';
$txt['error_search_string_small_words'] = 'Длина слова должна быть хотя бы в два символа.';
$txt['error_query_not_specific_enough'] = 'Ваш запрос не слишком информативен. Попробуйте использовать более длинные слова или целые фразы.';
$txt['error_no_messages_in_time_frame'] = 'В данном временном промежутке сообщений не найдено.';
$txt['error_no_labels_selected'] = 'Ни один параметр не выбран!';
$txt['error_no_search_daemon'] = 'Доступ к поиску запрещен';

$txt['profile_errors_occurred'] = 'При попытке сохранения настроек возникла следующая ошибка:';
$txt['profile_error_bad_offset'] = 'Неверно указана разница во времени';
$txt['profile_error_no_name'] = 'Вы не указали имя пользователя';
$txt['profile_error_name_taken'] = 'Выбранное имя уже используется';
$txt['profile_error_name_too_long'] = 'Выбранное имя слишком длинное. Имя не может быть длиннее 60 символов.';
$txt['profile_error_no_email'] = 'Вы не указали электронный адрес';
$txt['profile_error_bad_email'] = 'Вы ввели неверный электронный адрес';
$txt['profile_error_email_taken'] = 'Существует пользователь, который указал данный адрес';
$txt['profile_error_no_password'] = 'Вы не ввели пароль';
$txt['profile_error_bad_new_password'] = 'Новый пароль не подходит';
$txt['profile_error_bad_password'] = 'Не верно указан пароль';
$txt['profile_error_bad_avatar'] = 'Ваш аватар слишком большой, либо не является графическим файлом';
$txt['profile_error_password_short'] = 'Ваш пароль должен содержать как минимум %1$d символов.';
$txt['profile_error_password_restricted_words'] = 'Ваш пароль не должен содержать ваши имя, email, либо другую, доступную в вашем профиле, информацию.';
$txt['profile_error_password_chars'] = 'Ваш пароль должен содержать символы верхнего и нижнего регистров, а также цифры.';
$txt['profile_error_already_requested_group'] = 'Вы уже направили запрос на вступление в эту группу!';

// Use numeric entities in the below string, as it's to be used in emails.
$txt['database_error'] = 'Ошибка базы данных';
// Use numeric entities in the below string, as it's to be used in emails.
$txt['tried_to_repair'] = 'Wedge обнаружил и попытался автоматически исправить ошибки в базе данных. Если проблемы остались, пожалуйста, свяжитесь с техподдержкой хостинга.';

// Database errors (Class-DB.php)
$txt['mysql_error_space'] = ' — проверьте место под базу данных или обратитесь к своему хостеру.';
$txt['try_again'] = 'Пожалуйста, попробуйте снова. Если ошибка повторяется, пожалуйста, сообщите администратору.';
// Line number in a file.
$txt['line'] = 'Строка';

// Skin parsing errors
$txt['template_parse_error'] = 'Ошибка обработки шаблона!';
$txt['template_parse_error_message'] = 'Кажется, что-то произошло с системой шаблонов. Должно быть, это временная проблема, поэтому попробуйте зайти на форум позже. Если вы продолжаете видеть это сообщение, обратитесь к администратору.<br><br>Вы также можете попробовать <a href="javascript:location.reload();">обновить эту страницу</a>.';
$txt['template_parse_error_details'] = 'Не удалось загрузить шаблон или языковой файл: <tt><strong>%1$s</strong></tt>. Проверьте синтаксис и повторите попытку — помните, что одиночные кавычки (<tt>\'</tt>) должны быть экранированы с помощью косой черты (<tt>\\</tt>). Чтобы увидеть более подробную информацию об ошибке PHP, попробуйте <a href="{board_url}%1$s">прямой доступ к файлу</a>.<br><br>Можете попробовать <a href="javascript:location.reload();">обновить эту страницу</a> или <a href="<URL>?theme=1">использовать тему по умолчанию</a>.';

$txt['security_risk'] = 'СЕРЬЕЗНАЯ ПРОБЛЕМА В ПЛАНЕ БЕЗОПАСНОСТИ:';
$txt['cache_writable_head'] = 'Предупреждение о производительности';
$txt['cache_writable'] = 'Директория кэша недоступна для записи — это негативно скажется на производительности форума.';
$txt['not_removed'] = 'Файл <strong>%1$s</strong> не удален!';
$txt['not_removed_extra'] = '%1$s — резервная копия файла %2$s, которая не была создана Wedge. Доступ к нему возможен напрямую и используется для получения несанкционированного доступа к форуму. Вы должны немедленно удалить его.';

$txt['ssi_not_direct'] = 'Пожалуйста, не обращайтесь к SSI.php напрямую; можете использовать этот путь (%1$s) или добавьте в конце адреса ?ssi_function=что-нибудь.';
$txt['ssi_session_broken'] = 'SSI.php не смог загрузить сессию! Это может вызвать проблемы с выходом из системы и другими функциями — пожалуйста, убедитесь, что SSI.php подключен ранее *остальных* функций в ваших скриптах!';

$txt['icon_not_found'] = 'Иконка не найдена в используемой теме оформления. Пожалуйста, удостоверьтесь в том, что загрузили иконку на сервер, и попробуйте снова.';
$txt['icon_after_itself'] = 'Иконка не может идти сама после себя!';
$txt['icon_name_too_long'] = 'Имя иконки не может содержать более 16 символов';

$txt['name_censored'] = 'Извините, но имя, которое вы пытаетесь использовать — %1$s — содержит слово, подверженное цензуре. Пожалуйста, попробуйте другое имя.';

$txt['poll_already_exists'] = 'В теме может быть только одно голосование!';
$txt['poll_not_found'] = 'Нет голосования, относящегося к этой теме!';

$txt['error_while_adding_poll'] = 'Следующие ошибки возникли при добавлении голосования:';
$txt['error_while_editing_poll'] = 'Следующие ошибки возникли при редактировании голосования:';

$txt['loadavg_search_disabled'] = 'Из-за большой загрузки сервера, функция поиска временно отключена. Пожалуйста, попробуйте воспользоваться поиском немного позже.';
$txt['loadavg_generic_disabled'] = 'Извините, из-за большой загрузки сервера эта функция временно отключена.';
$txt['loadavg_allunread_disabled'] = 'Невозможно найти все непрочитанные темы из-за высокой загрузки сервера.';
$txt['loadavg_unreadreplies_disabled'] = 'Сервер перегружен. Пожалуйста, попробуйте еще раз.';
$txt['loadavg_show_posts_disabled'] = 'Пожалуйста, попробуйте немного позже. Сообщения этого пользователя недоступны из-за высокой загрузки сервера.';
$txt['loadavg_unread_disabled'] = 'В настоящее время сервер форума перегружен запросами, поэтому вы не сможете просмотреть список непрочитанных тем.';

$txt['cannot_edit_permissions_inherited'] = 'Вы не можете напрямую редактировать унаследованные разрешения. Нужно редактировать «родительскую» группу, либо наследование группы пользователей.';

$txt['mc_no_modreport_specified'] = 'Нужно выбрать отчёт, который вы хотите просмотреть.';
$txt['mc_no_modreport_found'] = 'Выбранный отчёт не существует или у вас нет прав на просмотр.';

$txt['st_cannot_retrieve_file'] = 'Не удалось получить файл %1$s.';
$txt['admin_file_not_found'] = 'Не удалось загрузить запрашиваемый файл: %1$s.';

$txt['themes_none_selectable'] = 'Одна из тем должна быть выбрана.';
$txt['themes_default_selectable'] = 'Должна быть выбрана тема оформления форума по умолчанию.';
$txt['ignoreboards_disallowed'] = 'Опция игнорирования разделов выключена.';
$txt['ignoretopics_disallowed'] = 'Опция игнорирования тем выключена.';

$txt['mboards_delete_error'] = 'Категория не выбрана!';
$txt['mboards_delete_board_error'] = 'Раздел не выбран!';
$txt['mboards_parent_own_child_error'] = 'Невозможно перенести в собственный подраздел!';
$txt['mboards_board_own_child_error'] = 'Невозможно сделать раздел своим же подразделом!';

$txt['smileys_upload_error_notwritable'] = 'Следующая папка смайлов не записываемая: %1$s';
$txt['smileys_upload_error_types'] = 'Изображения могут только этих форматов: %1$s.';

$txt['change_email_success'] = 'Ваш e-mail был изменен. Вам отправлено письмо для активации.';
$txt['resend_email_success'] = 'Новое письмо активации было успешно отправлено.';

$txt['custom_option_need_name'] = 'Эта опция профиля должна иметь имя!';
$txt['custom_option_not_unique'] = 'Название поля неуникально!';

$txt['movetopic_no_reason'] = 'Вы должны указать причину для перемещения этой темы, или отменить опцию \'Выберите тему для перенаправления\'.';
$txt['movetopic_no_pm'] = 'Вы должны ввести личное сообщение для отправки при перемещении этой темы, или отменить опцию \'Отправить сообщение автору темы\'.';

$txt['error_custom_field_too_long'] = 'Поле &quot;%1$s&quot; не может быть длиной больше чем %2$d символов.';
$txt['error_custom_field_invalid_email'] = 'Поле &quot;%1$s&quot; должно содержать действующий e-mail.';
$txt['error_custom_field_not_number'] = 'Поле &quot;%1$s&quot; должно содержать цифры.';
$txt['error_custom_field_inproper_format'] = 'Поле &quot;%1$s&quot; содержит информацию в неправильном формате.';
$txt['error_custom_field_empty'] = 'Поле &quot;%1$s&quot; не может быть оставлено пустым.';

$txt['email_no_template'] = 'Невозможно найти шаблон e-mail &quot;%1$s&quot;.';

$txt['search_api_missing'] = 'Невозможно найти API поиска! Пожалуйста, свяжитесь с администратором на предмет корректности сохраненных файлов.';
$txt['search_api_not_compatible'] = 'Выбранный API поиска форума устарел — форум переходит на стандартный поиск. Пожалуйста, проверьте файл %1$s.';

// Restore topic/posts
$txt['cannot_restore_first_post'] = 'Невозможно восстановить первое сообщение в теме.';
$txt['parent_topic_missing'] = 'Изначальная тема сообщения, которое вы пытаетесь восстановить, была удалена.';
$txt['restored_disabled'] = 'Восстановление тем запрещено.';
$txt['restore_not_found'] = 'Следующие сообщения не могут быть восстановлены; возможно, тема, изначально содержащая их, была удалена: <ul style="margin-top: 0px;">%1$s</ul>Вам следует вручную удалить их.';

$txt['error_invalid_dir'] = 'Вы ввели неправильное имя директории.';

// Merge double posts
$txt['merge_error_dbpo'] = 'Вам не разрешено выполнение этого действия.';
$txt['merge_error_notf'] = 'Извините, не удалось найти какое-либо сообщения для объединения.';
$txt['merge_error_noid'] = 'ID сообщения или темы не обнаружен!';
$txt['merge_error_length'] = 'Итоговое объединенное сообщение будет больше, чем разрешено в настройках форума!';

$txt['cannot_media_viewprofile'] = 'Вам не разрешено просматривать профили галереи';
$txt['default_layer_missing'] = 'Wedge не показал вам содержание этой страницы, поскольку было обнаружено повреждение макета &ndash; возможно, темой или плагином.<br><br>Об этом сообщено администратору.';
$txt['error_mismatched_tags'] = 'Найден неверный ББ-тег; исправьте его вручную, как показано ниже.<div class="bread">%1$s</div>';
$txt['error_missing_tags'] = 'Вы забыли закрыть ББ-тег; добавьте отсутствующий тег вручную, как показано ниже.<div class="bread">%1$s</div>';
