<?php
// Version: 2.0; Help

$txt['close_window'] = 'Закрыть окно';

$txt['cannot_change_voter_visibility'] = '
	Пользователи могут менять свой выбор в опросах, в зависимости от того, кто
	видит результаты опроса. Поэтому, как только видимость опроса устанавливается,
	её нельзя изменить, что позволяет пользователям голосовать, зная, кто будет
	в состоянии видеть их выбор.';

$txt['admins_see_votes'] = '
	Администраторы всегда могут видеть, кто и как проголосовал в опросах.
	Имея доступ к базе данных, они в любом случае смогут узнать выбор каждого.';

$txt['help_manage_boards'] = '
	Здесь можно создавать/редактировать/удалять разделы и категории. Например,
	если ваш форум посвящен спорту, машинам или музыке, целесообразно создать
	категории с соответствующими названиями. А внутри каждой из этих категорий
	разместить подкатегории или разделы. Тогда структура форума будет такой:<br>
	<ul class="list">
		<li>
			<strong>Спорт</strong>
			&nbsp;- "Категория"
		</li>
		<ul class="list">
			<li>
				<strong>Бейсбол</strong>
				&nbsp;- Раздел внутри категории "Спорт"
			</li>
			<ul class="list">
				<li>
					<strong>Статистика</strong>
					&nbsp;- Подраздел раздела "Бейсбол"
				</li>
			</ul>
			<li><strong>Футбол</strong>
			&nbsp;- Раздел внутри категории "Спорт"</li>
		</ul>
	</ul>
	Категории позволяют разделить форум на основные темы ("Авто",
	"Спорт"), и "Разделы", в каждом из которых пользователи могут оставлять
	сообщения на соответствующую тему. К примеру, пользователь, интересующийся
	автомобилями марки "Пинто", наверняка захочет оставить несколько
	сообщений в теме, посвященной этим машинам. Разбивка на категории позволяет
	людям быстрее находить то, что их интересует: вместо раздела "Магазин" можно
	создать два раздела "Оборудование" и "Одежда". Это намного упростит
	пользователям поиск нужной информации — они смогут сразу перейти
	в нужный раздел и искать там.<br>
	Как отмечалось выше, Раздел является ключевой темой, содержащей в себе
	другие по одной и той же тематике. Например, для обсуждения "Пинто" нужно
	всего лишь зайти в категорию "Автомобили" и перейти в раздел "Пинто".<br>
	Функции, доступные на этой странице, позволяют создавать новые разделы внутри
	каждой категории, изменять их, менять порядок, а также полностью удалять.';

$txt['help_need_deny_perm'] = '
	Как правило, контролировать доступ к разделам достаточно просто — пользователи,
	которые должны видеть раздел, к которому у них есть доступ, и те, кто не должны
	видеть (или могут видеть, но не могут зайти).<br><br>
	Хотя иногда вы можете специально запретить какой-нибудь группе просмотр раздела,
	но некоторые пользователи в этой группе могут быть членами и каких-либо других
	групп, в том числе с правом на просмотр. Например, у вас может быть группа
	нарушителей спокойствия, для применения к ней каких-либо ограничений.
	Вы можете запретить пользователям из этой группы доступ к определённым разделам.<br><br>
	Группа, которой запрещен просмотр (или вход) к какому-либо разделу, будет лишена
	данной возможности, независимо от принадлежности пользователей к каким-либо ещё
	группам, за исключением администраторов.';

$txt['help_edit_news'] = '
	<ul class="list">
		<li>
			<strong>Новости</strong><br>
			В этой секции можно настроить текст новостей, отображаемых на главной странице форума.
			Добавьте желаемый пункт (например, &quot;Не пропустите собрание во вторник!&quot;) и сохраните изменения. Новости будут отображаться в случайном порядке, по одной за раз.
		</li>
		<li>
			<strong>Рассылки</strong><br>
			В этой секции можно отправлять специальные сообщения пользователям форума, через личные сообщения или по электропочте. Для начала отметьте группы, которым хотите разослать сообщения. Кроме того, можно указать дополнительных адресатов. Затем введите текст сообщения и выберите тип рассылки: с помощью ЛС или же через e-mail.
		</li>
		<li>
			<strong>Настройки</strong><br>
			В этой секции содержится несколько настроек, относящихся к новостям и рассылкам, включая выбор групп, которые могут редактировать новости форума или отправлять информационные сообщения по почте.
		</li>
	</ul>';

$txt['help_view_members'] = '
	<ul class="list">
		<li>
			<strong>Просмотр всех пользователей</strong><br>
			Просмотр всех пользователей форума. Вам представляется список имен пользователей со ссылками. Можно нажать
            на любое из имен, чтобы просмотреть профили пользователей (домашняя страница, возраст,&nbsp;и&nbsp;т.&nbsp;д.), а также изменить их.
			Вы имеете полный контроль над пользователями, включая возможность их удаления с форума.<br><br>
		</li>
		<li>
			<strong>Ожидание подтверждения</strong><br>
			Эта секция доступна только при включении подтверждения администратором новых регистраций. Любой, кто регистрируется на вашем форуме, станет полноценным пользователем, но только после того как его кандидатура будет одобрена администратором.
			Этот раздел показывает список всех тех пользователей, которые ожидают одобрения, вместе с их электронными и IP-адресами.
			Вы в любой момент можете разрешить или отклонить (удалить) любого пользователя в списке, отметив галочкой поле напротив пользователя и выбрав нужное действие из выпадающего меню в нижней части экрана. При отклонении (удалении) пользователя его можно уведомить об этом.<br><br>
		</li>
		<li>
			<strong>Ожидание активации</strong><br>
			Эта секция доступна только при включении режима активации учётных записей. Здесь отображается список всех пользователей, которые пока не активировали свой аккаунт. В этом разделе можно разрешить, отклонить или напомнить пользователям о необходимости завершить процесс регистрации. Кроме того, можно уведомить пользователя о совершенных вами действиях.<br><br>
		</li>
	</ul>';

$txt['help_ban_gmail_style'] = 'Google-почта предлагает пользователям удобные функции организации электронных писем, которые могут запутать обычные системы фильтрации спама:
	<ul class="list">
		<li>Точки в имени пользователя игнорируются - joe.bloggs@gmail.com аналогично j.o.e.b.l.o.g.g.s@gmail.com и даже joebloggs@gmail.com.</li>
		<li>Пользователи могут добавлять «+метка» к первой части адреса для фильтрации почты. Например, joebloggs+work@gmail.com по-прежнему будет аналогично joebloggs@gmail.com, а метка «+work» будет использована для организации писем.</li>
	</ul>
	Установив параметр «GMail-стиль домена», эти факторы можно игнорировать.';

$txt['help_no_hostname_ban'] = 'Названия хостов пользователей отключены, поэтому все запреты, основанные на имени хоста, также не работают.';

$txt['help_ban_email_types'] = 'Адреса электропочты могут быть запрещены различными способами.
	<ul class="list">
		<li>Один или несколько заданных адресов — используется для запрета отдельных адресов электропочты или очень избирательных типов электронных писем, например troublemaker@example.com; если нарушитель использует адреса troublemaker1@example.com и troublemaker2@example.com, можно запретить все подобные адреса с помощью маски troublemaker*@example.com.</li>
		<li>Весь домен — если у нарушителя в распоряжении собственный домен, он может использовать адрес любого типа, по своему усмотрению. В этом случае воспользуйтесь данным вариантом и запретите весь домен целиком (часть адреса после знака @).</li>
		<li>Диапазон доменов — при преобладании спам-писем от .ru или .com адресов можно запретить не домены целиком, а лишь все адреса с указанными окончаниями.</li>
	</ul>';

$txt['help_ban_membername_style'] = 'При применении запрета или какого-либо ограничения на действительные имена пользователей можно применять его только к логинам или к отображаемым именам, либо и к тем, и к тем вместе. Логины — имена, используемые для авторизации на форуме, а отображаемые имена — те, которые видны другим пользователям на форуме. В большинстве случаев они будут одинаковыми, но пользователи обычно могут изменять свои отображаемые имена, в то время как логины могут быть изменены только администраторами форума.';

$txt['help_featuresettings'] = '
	Здесь можно изменить некоторые настройки форума, в соответствии со своими предпочтениями.';

$txt['help_time_format'] = '
	Вы обладаете большими возможностями по настройке времени и даты.
	Преобразования производятся с помощью функции <span class="bbc_tt">strftime</span> и описываются ниже (подробнее на <a href="http://php.net/manual/ru/function.strftime.php" target="_blank" class="new_win">php.net</a>).<br>
	<br>
	Среди прочего, распознаются следующие символы:
	<div style="padding: 5px 0 5px 30px">
		<span class="bbc_tt">%a</span> - краткое название дня недели<br>
		<span class="bbc_tt">%A</span> - полное название дня недели<br>
		<span class="bbc_tt">%b</span> - краткое название месяца<br>
		<span class="bbc_tt">%B</span> - полное название месяца<br>
		<span class="bbc_tt">%d</span> - день месяца (01 ... 31)<br>
		<span class="bbc_tt" style="color: #999">%D</span> - короткая дата, то же, что и %m/%d/%y<br>
		<span class="bbc_tt">%e</span> - день месяца (1 ... 31)<br>
		<span class="bbc_tt">%@</span> - день месяца (1 ... 31)<br>
		<span class="bbc_tt">%H</span> - час в 24-часовом формате (диапазон между 00 и 23)<br>
		<span class="bbc_tt">%I</span> - час в 12-часовом формате (диапазон между 01 и 12)<br>
		<span class="bbc_tt">%m</span> - месяц как число (01 ... 12)<br>
		<span class="bbc_tt">%M</span> - минуты как число (00 ... 59)<br>
		<span class="bbc_tt">%p</span> - добавление "AM" или "PM", в соответствии с установленным временем<br>
		<span class="bbc_tt" style="color: #999">%R</span> - час и минуты, то же, что и %H:%M<br>
		<span class="bbc_tt">%S</span> - секунды как число (00 ... 59)<br>
		<span class="bbc_tt" style="color: #999">%T</span> - часы, минуты и секунды, то же, что и %H:%M:%S<br>
		<span class="bbc_tt">%y</span> - 2 цифры года (00 ... 99)<br>
		<span class="bbc_tt">%Y</span> - 4 цифры года<br>
		<span class="bbc_tt">%%</span> - символ \'%\'<br>
	</div>
	<em>* Выделенные серым цветом символы не работают на Windows-серверах.</em>';

$txt['help_live_news'] = '
	В этом блоке отображаются последние обновленные новости с <a href="https://wedge.org/" target="_blank" class="new_win">wedge.org</a>.
	Просматривайте их время от времени для получения информации об обновлениях, новых релизах, и важной информации от Wedge.';

$txt['help_registrations'] = '
	Этот раздел содержит все функции, которые могут быть необходимыми для управления новыми регистрациями на форуме. Содержит до трёх разделов, которые видны в зависимости от настроек форума. Среди них:<br><br>
	<ul class="list">
		<li>
			<strong>Регистрация нового пользователя</strong><br>
			Здесь можно зарегистрировать нового пользователя. Это может быть полезно на тех форумах, где регистрация закрыта
            для новых пользователей, или в случаях, когда администратор хочет создать тестовую учётную запись. Если выбрана опция "требовать активацию учётной записи",
            пользователю будет отправлен e-mail со ссылкой для активации, по которой он должен будет перейти, прежде чем сможет использовать учётную запись. Также можно
            использовать отправку нового пароля на заданные e-mail.<br><br>
		</li>
		<li>
			<strong>Регистрационное соглашение</strong><br>
			Это позволяет задать текст для регистрационного соглашения, отображаемого при регистрации на форуме.
			Можно добавить или удалить что угодно из стандартного регистрационного соглашения Wedge.<br><br>
		</li>
		<li>
			<strong>Настройки</strong><br>
			Этот раздел будет виден только при наличии прав администрирования. Здесь можно выбрать метод регистрации,
            используемый на форуме, а также другие настройки, относящиеся к регистрации.
		</li>
	</ul>';
$txt['help_login_type'] = 'Этот параметр отвечает за то, должны ли пользователи использовать логин или адрес электропочты, или что угодно из перечисленного на выбор для входа на форум. Важно отметить, что при использовании логина пароль перед отправкой обычно зашифровывается, а при указании электропочты — нет.';

$txt['help_modlog'] = '
	Этот раздел позволяет модераторам отслеживать все действия по модерированию, которые сделали модераторы форума. Чтобы быть уверенным, что модераторы не удалят ссылки на совершенные ими действия, установлен запрет на удаление этих данных в течение 24 часов после предпринятого действия.';
$txt['help_adminlog'] = '
	Этот раздел позволяет администраторам отслеживать некоторые административные действия, произведенные на форуме. Чтобы быть уверенным, что администраторы не смогут сразу удалить упоминания о своих действиях, записи не могут быть удалены в течение 24 часов со времени произведенного действия.';
$txt['help_error_log'] = '
	Лог ошибок отображает каждую ошибку, с которой столкнулись пользователи при использовании форума. Ошибки сортируются по дате, можно выбрать сортировку, нажав на чёрную стрелку напротив каждой даты. Кроме того, можно отфильтровать ошибки, нажав на изображение рядом с каждой ошибкой. Это позволяет фильтровать ошибки, к примеру, по пользователям. Когда фильтр включен, будут показаны только те результаты, которые соответствуют данному фильтру.';
$txt['help_smileys'] = '
	Здесь можно добавлять, удалять смайлы, или наборы смайлов. Заметьте, что если смайл один в наборе, то он появляется во всех наборах — иначе он может смутить ваших пользователей, использующих разные наборы.<br><br>

	Здесь также редактируются иконки сообщений, если они включены на странице настроек.';

$txt['help_serversettings'] = '
	Здесь можно изменять основные настройки форума. Этот раздел включает в себя настройки базы данных и URL-адресов, а также настройки отсылки сообщений и кэширование. Прежде чем изменять данные настройки, хорошенько подумайте, потому как неправильная настройка может привести форум в нерабочее состояние.';
$txt['help_manage_files'] = '
	<ul class="list">
		<li>
			<strong>Просмотр файлов</strong><br>
			Просмотр всех вложений, аватаров и миниатюр, сохраненных Wedge.<br><br>
		</li><li>
			<strong>Свойства вложений</strong><br>
			Конфигурация директорий для хранения вложений, а также установка ограничений на типы вложений.<br><br>
		</li><li>
			<strong>Свойства аватаров</strong><br>
			Конфигурация директорий для хранения аватаров, а также управление изменением размеров аватаров.<br><br>
		</li><li>
			<strong>Обслуживание файлов</strong><br>
			Проверка и исправление любых ошибок в директории вложений, а также удаление выбранных вложений.<br><br>
		</li>
	</ul>';

$txt['help_topicSummaryPosts'] = 'Это позволяет устанавливать число предыдущих сообщений, отображаемых под краткой сводкой темы в окне ответа.';
$txt['help_enableAllMessages'] = 'Установите здесь <em>максимальное</em> число сообщений в теме, которые будут показаны по ссылке &quot;все&quot;. Установка этого параметра ниже, чем "Максимальное количество сообщений для отображения на странице темы" приведёт к тому, что сообщения не будут отображаться совсем, а слишком высокое значение, наоборот, может замедлить работу форума.';
$txt['help_pruneSavedDrafts'] = 'Черновики, сохранённые на сервере, не имеют каких-либо ограничений, но администратор может использовать эту опцию, чтобы автоматически удалять старые черновики, для уменьшения объёма базы данных. Если указать число, то черновики с датой старше указанного количества дней будут удалены. Если указать 0, черновики будут сохраняться до тех пор, пока автор не примет решение опубликовать их или удалить.';
$txt['help_allow_guestAccess'] = 'Убрав здесь галочку, можно запретить гостям делать что-либо, кроме базовых функций: вход, регистрация, напоминание пароля и пр. Это не то же самое, что запрет доступа гостям к форуму.';
$txt['help_userLanguage'] = 'Включение этого параметра позволит пользователям выбирать, какой языковой файл они будут использовать. Это не повлияет на выбор по умолчанию.';
$txt['help_availableLanguage'] = 'Этот параметр определяет, будут ли языки предоставлены пользователям в качестве выбора; они могут быть установлены, но недоступны для выбора.';
$txt['help_trackStats'] = 'Статистика:<br>Это разрешит пользователям видеть последние сообщения и наиболее популярные темы на вашем форуме.
		Также это показывает некоторую статистику, такую как наибольшее количество пользователей онлайн, новые пользователи и новые темы.<hr>
		Просмотры страницы:<br>Добавляет ещё колонку в страницу статистики, на которой показывается число просмотров страниц.';
$txt['help_titlesEnable'] = 'Включение надписи над аватаром, позволит пользователям с соответствующими правами создавать специальные названия для себя. 		Это будет отображаться под именем.<br><em>Например:</em><br>Петя<br>Классный парень';
$txt['help_todayMod'] = 'Это будет показывать «Сегодня» или «Вчера», вместо отображения полной даты.<br><br>
		<strong>Примеры:</strong><br><br>
		<dt>
			<dt>Отключить</dt>
			<dd>3 октября 2009 в 00:59:18</dd>
			<dt>Только «Сегодня»</dt>
			<dd>Сегодня в 00:59:18</dd>
			<dt>«Сегодня» и «Вчера»</dt>
			<dd>Вчера в 21:36:55</dd>
		</dt>';
$txt['help_disableCustomPerPage'] = 'Отметьте эту опцию, чтобы запретить пользователям индивидуальную настройку количества выводимых сообщений и тем на одной странице.';
$txt['help_enablePreviousNext'] = 'Отображение ссылок на следующую и предыдущую темы.';
$txt['help_ignoreMoveVsNew'] = 'По умолчанию при перемещении тем между разделами пользователю предлагается список только тех разделов, в которых он может создавать темы (поэтому он не сможет переместить тему в раздел новостей, например).<br><br>Включение этого параметра позволит выводить список абсолютно всех разделов, без каких-либо ограничений.';
$txt['help_webmaster_email'] = 'Этот параметр позволяет указать электропочту основного администратора форума (например, для срочных уведомлений об ошибках базы данных, поэтому используйте <em>действительно</em> правильный адрес.';
$txt['help_mail_from'] = 'Этот параметр позволяет указать отдельную электропочту для использования в качестве адреса отправителя для всей исходящей корреспонденции (уведомления, рассылки...)
		<br><br>Если оставить поле пустым, Wedge будет использовать электропочту администратора для всех уведомлений.
		То есть администратор будет получать любые уведомления, включая информацию об ошибках доставки.<br>Не очень круто, правда?
		<br><br>Используйте фиктивный адрес отправителя типа "no-reply@my-domain.com", и, если возможно, убедитесь, что все электронные письма, отправляемые на этот адрес, возвращаются обратно отправителю.';
$txt['help_enableCompressedOutput'] = 'С помощью этой опции активируется сжатие передаваемых страниц для снижения загрузки канала, но необходима установленная библиотека zlib.';
$txt['help_enableCompressedData'] = 'С помощью этой опции активируется сжатие CSS и JS файлов после их кэширования. Требуется установленная библиотека zlib и правильные настройки .htaccess. Это избавит сервер от сжатия файлов при каждом запросе.
		Если опция не работает, таблицы стилей и скрипты будут неактивны. В этом случае немедленно отключите данную настройку.
		<br><br>Обратите внимание: эта функция может конфликтовать с обратными прокси типа Nginx, если они настроены на обслуживание *.gz файлов напрямую. Добавьте исключение, чтобы объявить их как текстовые файлы, или удалите расширение из своего списка статических файлов.';
$txt['help_obfuscate_filenames'] = 'Этот параметр отвечает за изменение имен JS и CSS файлов при их кэшировании. Смысл в том, чтобы осложнить жизнь воришкам исходного кода. Конспирация, одним словом.<br><br>
		В любом случае, если имена файлов будут зашифрованы, злоумышленники не смогут найти неизменённые исходные файлы. Очевидно, что если минификация отключена, эта опция совершенно бессмысленна. На заметку.';
$txt['help_minify'] = 'Этот параметр отвечает за минификацию файлов JavaScript при их кэшировании. Если разрешить Wedge минимизировать файлы, он удалит все комментарии и бесполезные пробелы, увеличив скорость загрузки сайта. Минификации подлежат только кэшированные файлы, оригинальные остаются нетронутым.<br><br>
		Использование Packer для минификации более предпочтительнее, с одной оговоркой: если ваши скрипты жёстко запрограммированы, их работоспособность будет нарушена (воспользуйтесь <a href="http://www.jslint.com/" target="_blank">JSLint</a>
		для исправления). Кроме того, если сжатие gzip недоступно на вашем сервере, Packer будет сжимать файлы как и раньше, но с небольшой задержкой (из-за дополнительной распаковки). В противном случае воспользуйтесь сервисом JSMin, который является хорошим компромиссом, если ваши скрипты не будут работать.<br><br>
		Примечание о Google Closure. Вместо запуска локального PHP-скрипта для минификации ваших JS-файлов они будут отправлены на сервера Google. В ответ придут уменьшенные версии этих файлов. Closure немного эффективнее Packer, но процесс обработки файлов занимает больше времени, поэтому, если вы часто обновляете файлы форума, рекомендуем выбрать Packer. К тому же существует ограничение на количество файлов, которое вы можете минимизировать в течение одного часа.
		Wedge обнаружит любые возникшие проблемы и при необходимости переключится на использование Packer автоматически.<br><br>
		Отключите эту опцию, если разрабатываете какую-то модификацию, это облегчит отладку.';
$txt['help_jquery_origin'] = 'Этот параметр отвечает за выбор сервера, с которого будет загружаться библиотека jQuery. Для сохранения пропускной способности можно использовать любой CDN, предоставленный Google или Microsoft. Также можно загружать jQuery напрямую с официальных серверов jquery.com.
		<br><br>При загрузке jQuery с вашего сайта скрипт будет сжиматься вместе с другими. Если на сервере не поддерживается библиотека zlib (для сжатия файлов), используйте любой CDN из предоставленных выше...';
$txt['help_db_show_debug'] = 'Включает отладку запросов. Очень полезная функция для разработчиков модификаций, отображает в нижней части страницы различную информацию.<br><br>
		Отображаются следующие элементы:
		<ul>
			<li>Загруженные файлы шаблонов
			<li>Блоки, которые были выполнены (функции шаблонов, используемые для построения страницы)
			<li>Загруженные языковые файлы
			<li>Загруженные CSS-файлы (CSS-файлы модов могут отсутствовать в этом списке)
			<li>Количество подключенных файлов (и их имена)
			<li>Попадания в кэш
			<li>Используемые запросы (доступно только администраторам)
		</ul>';
$txt['help_db_show_debug_who'] = 'Отладочная информация очень полезна для диагностики проблем, возникающих в работе форума. Этот параметр указывает, кому будет отображаться информация об отладке, когда она включена.';
$txt['help_db_show_debug_who_log'] = 'Часть отладочной информации представляет собой список всех запросов, выполненных форумом при загрузке текущей страницы. По соображениям безопасности такая информация будет отображаться только при необходимости.';
$txt['help_databaseSession_enable'] = 'Этот параметр использует базу данных для хранения сеансов - лучше всего подходит для серверов с балансировкой нагрузки, помогает со всеми проблемами превышения времени выполнения запроса и может ускорить работу форума.';
$txt['help_databaseSession_loose'] = 'Этот параметр уменьшит пропускную способность форума. При возвращении на страницу она не будет загружаться заново. Недостатком же является то, что иконки не будут обновляться, как и некоторые другие вещи, до тех пока не будет нажата кнопка «Обновить» (F5).';
$txt['help_databaseSession_lifetime'] = 'Продолжительность сессии (в секундах) после последней активности. Рекомендованное значение — более 2400.';
$txt['help_enableErrorLogging'] = 'Запись любых ошибок, таких как попытка авторизации, чтобы разобраться в дальнейшем, что именно пошло не так.';
$txt['help_enableErrorQueryLogging'] = 'В лог ошибок будет включен полный текст запроса, отправленного к базе данных. Регистрация ошибок должна быть включена.<br><br><strong>Примечание:  Это повлияет на возможность фильтрации ошибок в логах по сообщениям.</strong>';
$txt['help_allow_disableAnnounce'] = 'Это разрешит пользователям не получать уведомления о темах (когда автор устанавливает галочку «Объявление темы»).';
$txt['help_disallow_sendBody'] = 'Эта настройка убирает возможность получать текст ответов и сообщений в письмах уведомлений.<br><br>Часто пользователи могут отвечать на письма уведомлений, что в большинстве случаев означает то, что этот ответ получает веб-мастер.';
$txt['help_timeLoadPageEnable'] = 'Отображение в нижней части форума времени в секундах, которое понадобилось для генерации конкретной страницы.';
$txt['help_removeNestedQuotes'] = 'При включении этой опции из сообщений будут удаляться вложенные цитаты (вместо них останутся ссылки).';
$txt['help_max_image_width'] = 'Это позволяет задать максимальный размер для размещаемых картинок. Изображения с меньшим размером затронуты не будут.';
$txt['help_mail_type'] = 'Эта настройка позволяет выбрать установки PHP по умолчанию, или задать свои настройки SMTP. PHP не поддерживает SMTP-аутентификацию, так что, если это нужно, выберите SMTP. Но помните, что SMTP может работать медленнее, и некоторые сервера не будут принимать имя пользователя и пароль.<br><br>Вам не нужно заполнять настройки SMTP, если установлены настройки PHP по умолчанию.';
$txt['help_attachment_manager_settings'] = 'Вложения — это файлы, которые пользователи могут загружать на форум и прикреплять к своим сообщениям.<br><br>
		<strong>Проверять расширения вложений</strong>:<br> Хотите проверять расширения загружаемых файлов?<br>
		<strong>Доступные расширения вложений</strong>:<br> Можно установить допустимые типы прикрепляемых файлов, чтобы пользователи не могли загрузить что-то лишнее или опасное.<br>
		<strong>Папка вложений</strong>:<br> Относительный путь к директории для хранения вложений<br>(например: /home/sites/yoursite/www/forum/attachments)<br>
		<strong>Максимальный размер папки вложений</strong> (в КБ):<br> Выберите максимальный предел, по достижении которого директория вложений будет считаться полностью заполненной.<br>
		<strong>Максимальный размер вложения в одном сообщении</strong> (в КБ):<br> Выберите общий максимальный размер всех вложений, прикрепляемых к одному сообщению. При достижении предела дальнейшее прикрепление вложений будет ограничено.<br>
		<strong>Максимальный размер вложения</strong> (в КБ):<br> Выберите максимальный размер каждого отдельного вложения.<br>
		<strong>Максимальное количество вложений в сообщении</strong>:<br> Выберите количество вложений, которое пользователь может прикрепить к одному сообщению.<br>
		<strong>Отображать прикрепленные картинки под сообщением</strong>:<br> Если загружаемый файл является изображением, оно будет отображено в виде эскиза под сообщением.<br>
		<strong>Изменять размер изображения при отображении под сообщением</strong>:<br> В сочетании с опцией, указанной выше, данный параметр позволяет уменьшить размер изображений для их отображения в качестве эскизов.<br>
		<strong>Максимальная ширина и высота эскизов</strong>:<br> Используется только с функцией выше. В соответствии с заданными значениями размер изображений будет пропорционально изменяться.';
$txt['help_attachment_image_paranoid'] = 'При выборе этой опции будет включена очень строгая проверка вложенных изображений. Предупреждение! Эту проверку могут не пройти и нормальные изображения. Поэтому настоятельно рекомендуется использовать данную опцию только совместно с обработкой изображений, чтобы в случае необходимости могла произойти повторная выборка изображений, не прошедших проверку безопасности. После прохождения проверки такие изображения будут подчищены и загружены. В противном случае, если обработка изображений не включена, любые вложения, провалившие проверку безопасности, будут отклонены.';
$txt['help_attachment_image_reencode'] = 'При выборе этой опции будет производиться попытка перекодирования загружаемых вложений, для обеспечения более высокой безопасности. Обратите внимание: после перекодирования все анимированные изображения станут статичными.';
$txt['help_avatar_paranoid'] = 'При выборе этой опции будет включена очень строгая проверка аватаров. Предупреждение! Эту проверку могут не пройти и нормальные изображения. Поэтому настоятельно рекомендуется использовать данную опцию только совместно с обработкой аватаров, чтобы в случае необходимости могла произойти повторная выборка изображений, не прошедших проверку безопасности. После прохождения проверки такие изображения будут подчищены и загружены. В противном случае, если обработка аватаров не включена, любые аватары, провалившие проверку безопасности, будут отклонены.';
$txt['help_avatar_reencode'] = 'При выборе этой опции будет производиться попытка перекодирования загружаемых аватаров, для обеспечения более высокой безопасности. Обратите внимание: после перекодирования все анимированные изображения станут статичными.';

$txt['help_localCookies'] = 'Wedge использует куки для хранения данных авторизации на компьютере клиента.
	Эти файлы могут храниться глобально (myserver.com) или локально (myserver.com/path/to/forum).<br>
	Отметьте эту опцию, если испытываете проблемы с пользователями, которых автоматически выкидывает с форума.<hr>
	Хранящиеся глобально куки менее безопасны при использовании на общедоступном веб-сервере (типа Tripod).<hr>
	Локальные куки не работают за пределами папки форума, поэтому, если ваш форум находится, к примеру, по адресу www.myserver.com/forum, страницы типа www.myserver.com/index.php не смогут получить доступ к информации учётной записи.
	Глобальное хранение особенно рекомендуется при использовании SSI.php.';
$txt['help_allow_non_mod_edit'] = 'Обычно пользователи могут редактировать свои сообщения. Но если модераторы внесли какие-то правки, например, удалили оскорбительное содержимое — дальнейшее редактирование пользователям запрещается. Эта опция снимет ограничения.';
$txt['help_enableBBC'] = 'Включение этой опции позволит пользователям использовать ББ-код на форуме, для вставки изображений, форматирования текста и многого другого.';
$txt['help_time_offset'] = 'Не все администраторы хотят, чтобы форум использовал то же время, которое действует на сервере. Используя эту функцию, можно указать разницу во времени (в часах). Допускаются отрицательные и десятичные значения.';
$txt['help_default_timezone'] = 'Временная зона сервера указывает PHP, где сервер находится. Убедитесь, что этот параметр установлен корректно, соответственно стране и городу установки сервера. Дополнительная информация на <a href="http://php.net/manual/ru/timezones.php" target="_blank">сайте PHP</a>.';
$txt['help_spamWaitTime'] = 'Здесь можно указать время, которое необходимо подождать для отправки следующего сообщения. Это может предотвратить спам, флуд или оффтоп на форуме.';

$txt['help_enablePostHTML'] = 'Это позволит использовать HTML-теги в сообщениях пользователей:
	<ul class="list" style="margin-bottom: 0">
		<li>&lt;b&gt;, &lt;u&gt;, &lt;i&gt;, &lt;s&gt;, &lt;em&gt;, &lt;ins&gt;, &lt;del&gt;</li>
		<li>&lt;a href=""&gt;</li>
		<li>&lt;img src="" alt=""&gt;</li>
		<li>&lt;br&gt;, &lt;hr&gt;</li>
		<li>&lt;pre&gt;, &lt;blockquote&gt;</li>
	</ul>';

$txt['help_themes'] = 'Здесь можно выбрать тему оформления, которая будет использоваться по умолчанию. Нажмите на тему, чтобы изменить её настройки.';
$txt['help_theme_install'] = 'Здесь можно установить новую тему оформления. Вы можете установить её из уже существующей директории на сервере, загрузить с сайта, либо скопировать уже существующую тему и внести в её код нужные изменения.<br><br>Архив с темой или директория должны содержать файл <tt>theme_info.xml</tt>.';
$txt['help_enableEmbeddedFlash'] = 'Эта функция позволит пользователям встраивать Flash-приложения в свои сообщения. Используйте на свой страх и риск!';
// !!! Add more information about how to use them here.
$txt['help_xmlnews_enable'] = 'Ленты Atom подобны RSS, но лучше.<br>
	Эта опция позволяет пользователям получать новости форума без необходимости заходить на него, через клиенты RSS/Atom или сервисы типа Feedly.
	Рекомендуется ограничить размер сообщений/новостей, для правильного отображения RSS-новостей в разных клиентах.';
$txt['help_globalCookies'] = 'Использование кросс-доменных куки. Например, если ваш сайт расположен по адресу http://www.example.com/, а форум на поддомене http://forum.example.com/, то, используя эту функцию, пользователи могут заходить на ваш сайт, используя кросс-доменные куки форума. Не применяйте эту функцию, если используются какие-то другие домены (например, hacker.example.com), которые не принадлежат вам.<br><br>
Не работает, если включено локальное хранение куки.';
$txt['help_secureCookies'] = 'Включение этой опции отметит все созданные для пользователей куки как безопасные. Используйте эту функцию только при наличии HTTPS-протокола на вашем сервере!';
$txt['help_securityDisable_why'] = 'Введите ваш текущий пароль (используемый для входа на форум).<br><br>Необходимо подтвердить, что именно <strong>вы</strong> изменяете настройки.';
$txt['help_emailmembers'] = 'В этом сообщении можно использовать следующие «переменные»:<br>
	{$board_url} - URL-адрес форума.<br>
	{$current_time} - Текущее время.<br>
	{$member.email} - E-mail пользователя.<br>
	{$member.link} - Ссылка на профиль пользователя.<br>
	{$member.id} - Идентификатор пользователя.<br>
	{$member.name} - Имя пользователя.<br>
	{$latest_member.link} - Ссылки на профили последних зарегистрированных пользователей.<br>
	{$latest_member.id} - Идентификаторы последних зарегистрированных пользователей.<br>
	{$latest_member.name} - Имена последних зарегистрированных пользователей.';
$txt['help_attachmentEncryptFilenames'] = 'Кодирование имен файлов вложений позволяет прикреплять к сообщениям файлы с одинаковыми именами, для нормального использования php файлов и повышения безопасности. Однако это также может привести к невозможности перестроить базу данных, если произойдёт что-то непредвиденное.';

$txt['help_failed_login_threshold'] = 'Установите количество неудачных попыток входа, после чего произойдет перенаправление на восстановление пароля.';
$txt['help_enable_quick_login'] = 'Включите, чтобы показывать в сайдбаре компактную форму авторизации для гостей.';
$txt['help_oldTopicDays'] = 'Если эта функция включена, форум оповестит пользователя о том, что тема уже устарела и предложит начать новую тему, если он будет пытаться ответить в нее.';
$txt['help_edit_wait_time'] = 'Количество секунд, в течение которых пользователь сможет отредактировать только что отправленное им сообщение, в котором не будет написано, что оно отредактировано.';
$txt['help_edit_disable_time'] = 'Количество минут, в течение которых пользователь сможет отредактировать свое сообщение. 0 — отключить.<br><br><em>Примечание: Если у пользователя есть право редактировать любые сообщения, это ограничение на него не распространяется.</em>';
$txt['help_posts_require_captcha'] = 'Эта функция заставит пользователей вводить проверочный код при публикации каждого сообщения. Ввод кода обязателен для всех пользователей с количеством сообщений меньше заданного — это должно помочь в борьбе с рассылкой возможного спама.';
$txt['help_disable_wysiwyg'] = 'Эта опция отключает для всех пользователей возможность использовать редактор WYSIWYG при создании сообщений.';
$txt['help_lastActive'] = 'Количество минут, в течение которых пользователь будет считаться находящимся онлайн. По умолчанию — 15.<br><br>Установка слишком высоких значений не рекомендуется, поскольку в таком случае реальное наличие посетителей на форуме в конкретный момент времени будет под сомнением.';

$txt['help_customoptions'] = 'В этом разделе определены параметры, которые пользователь может выбирать из выпадающего списка. Есть несколько ключевых моментов, на которые стоит обратить внимание:
	<ul class="list">
		<li><strong>Параметр по умолчанию:</strong> Этот параметр будет выбран изначально.</li>
		<li><strong>Удаление параметров:</strong> Для удаления любого параметра просто очистите его текстовое поле.</li>
		<li><strong>Изменение порядка параметров:</strong> Можно изменить порядок параметров, перемещая текст между блоками. Но помните — необходимо убедиться, что в результате данной операции текст <strong>не</strong> изменился.</li>
	</ul>';

$txt['help_autoFixDatabase'] = 'Эта функция автоматически исправит ошибки в таблицах базы данных. После завершения работы функции вы получите письмо с уведомлением.';

$txt['help_enableParticipation'] = 'Если в теме содержатся сообщения пользователя, просматривающего раздел, то внутри иконок слева от соответствующей темы появится специальный значок.';
$txt['help_correctExclamations'] = 'Если выбрано, этот параметр запрещает пользователям ставить много вопросительных и восклицательных знаков в заголовках тем, автоматически обрезая их до одного. Например, заголовок «ПОМОГИТЕ!!!!!!» будет преобразован в «ПОМОГИТЕ!»';
$txt['help_correctShouting'] = 'Если установить процент выше 0, заголовки тем будут проверяться на наличие капсаI. Установленный процент символов будет преобразован в нижний регистр. Например, заголовок «БЫСТРО ПОМОГИТЕ КТО-НИБУДЬ» будет преобразован в «Быстро Помогите Кто-нибудь». Установите 0% для отключения.';

$txt['help_db_persist'] = 'Оставлять соединение активным для улучшения производительности форума. Если не используете выделенный сервер, с этой функцией могут возникнуть проблемы.';
$txt['help_ssi_db_user'] = 'Необязательный параметр: использование разных имени пользователя (для базы данных) и пароля при работе с SSI.php.';

$txt['help_countChildPosts'] = 'Включение этой функции означает, что сообщения, расположенные в подразделах родительского раздела, будут учитываться в общей статистике форума.<br><br>Запросов станет больше, но родительские категории без сообщений перестанут отображать «0».';
$txt['help_ignorable_boards'] = 'Эта опция позволяет пользователям помечать определенные разделы игнорируемыми — в этом случае они всегда будут отображаться как «прочитанные», а темы из этих разделов не будут появляться в «Последних сообщениях» или «Непрочитанных темах».';
$txt['help_allow_ignore_topics'] = 'Включение этой функции позволит пользователям выбирать разделы, которые они хотели бы игнорировать при просмотре <em>Непрочитанных ответов</em> или <em>Непрочитанных сообщений</em>.';

$txt['help_display_flags'] = 'В дополнение к общему языку форума можно установить язык для каждого раздела отдельно. Этот параметр отвечает за отображение флажка языка внутри раздела:
	<ul class="list">
		<li><strong>Без флажков</strong> - не отображать никаких флажков на главной странице.</li>
		<li><strong>Флажки внутри разделов с установленным языком</strong> - если для раздела выбран язык по умолчанию, флажок этого языка будет отображаться рядом с названием разделаi.</li>
		<li><strong>Флажки языков для всех разделов</strong> - отображать флаг рядом с названием каждого раздела, в котором задан язык по умолчанию (если пользователь не выбрал другой).</li>
	</ul>';

$txt['help_who_enabled'] = 'Эта опция позволяет пользователям просматривать, кто в данный момент находится на форуме и чем он занимается.';

$txt['help_recycle_enable'] = 'Перемещение удаленных тем и сообщений в специальный раздел (чтобы восстановить при необходимости).';

$txt['help_max_pm_recipients'] = 'Эта опция позволяет установить максимальное количество получателей при отсылке личных сообщений пользователем форума. Это может использоваться как предотвращение использования системы личных сообщений для рассылки спама. Обратите внимание: пользователи, которым разрешено делать объявления, не подвергаются этому ограничению. Установите 0 для отмены ограничений.';
$txt['help_pm_posts_verification'] = 'Данная настройка заставит пользователей вводить код, отображаемый на изображении, каждый раз при отправке личного сообщения. Пользователи, имеющие определенное количество сообщений, не будут вводить код — это должно помочь в борьбе с автоматическими рассылками спама.';
$txt['help_pm_posts_per_hour'] = 'Это ограничит количество личных сообщений, отсылаемых в течение одного часа. Это не затрагивает администраторов и модераторов.';

$txt['help_registration_method'] = 'Эта опция определяет метод регистрации на вашем форуме. Доступны следующие методы:<br><br>
	<ul class="list">
		<li>
			<strong>Регистрация запрещена</strong><br>
				Означает, что никто не может регистрироваться на форуме.<br>
		</li><li>
			<strong>Мгновенная регистрация</strong><br>
				Новые пользователи могут сразу входить на форум и оставлять сообщения.<br>
		</li><li>
			<strong>Активация пользователя</strong><br>
				Означает, что пользователь должен активировать свою учётную запись, перейдя по ссылке, присланной в письме.<br>
		</li><li>
			<strong>Активация, затем подтверждение пользователя</strong><br>
				При выборе этого варианта пользователь после регистрации получит электронное письмо, содержащее ссылку для активации. После перехода по этой ссылке пользователю нужно будет дождаться подтверждения администратора.
		</li><li>
			<strong>Подтверждение пользователя</strong><br>
				Означает, что администратор форума должен подтвердить учётную запись, прежде чем пользователь будет иметь доступ к основным функциям форума.
		</li>
	</ul>';

$txt['help_send_validation_onChange'] = 'Если этот флажок установлен, все пользователи, которые изменяют свой адрес электронной почты в профиле, должны будут повторно активировать свою учётную запись из сообщения электронной почты, отправленного на этот адрес';
$txt['help_send_welcomeEmail'] = 'При включении этой функции пользователи, прошедшие регистрацию, будут получать пригласительное письмо с форума';
$txt['help_password_strength'] = 'Эта функция определяет политику паролей пользователей.
	Доступные варианты:
	<ul class="list">
		<li><strong>Низкое:</strong> Пароль должен содержать как минимум 4 символа.</li>
		<li><strong>Среднее:</strong> Пароль должен содержать как минимум 8 символов и не может совпадать с именем или e-mail.</li>
		<li><strong>Высокое:</strong> Пароль должен содержать символы верхнего и нижнего регистров и как минимум из одного числа.</li>
	</ul>';

$txt['help_coppaAge'] = 'TЗначение в этом поле определяет минимальный возраст пользователя на форуме. Во время регистрации пользователю будет предложено подтвердить его возраст и, если он подходит под определенное правило, пользователь сможет продолжить регистрацию. Если значение равно нулю, возраст учитываться не будет.';
$txt['help_coppaType'] = 'Если на форуме стоит учет возраста и возраст пользователя меньше чем определено в настройках регистрации, существуют два дальнейших действия, а именно:
	<ul class="list">
		<li>
			<strong>Отменить регистрацию</strong><br>
				Любому новому участнику, не достигшему минимального возраста, будет немедленно отказано в регистрации.<br>
		</li><li>
			<strong>Запросить подтверждение у родителей/опекуна</strong><br>
				Учётная запись любого нового участника, который пытается зарегистрироваться и не достиг минимального разрешенного возраста, будет помечена как ожидающая одобрения, и будет представлена с формой, на которой родители/опекуны должны дать разрешение стать членом форумов.
				Им также будут представлены контактные данные форума, указанные в настройках, чтобы они могли отправить форму администратору по почте или факсу.
		</li>
	</ul>';
$txt['help_coppaPost'] = 'Введите в это поле электронный адрес, куда родители/опекуны смогут отправить подтверждение о разрешении на регистрацию.';

$txt['help_allow_hideOnline'] = 'Эта функция позволяет пользователям скрывать свой онлайн-статус на форуме от всех, кроме администраторов.';

$txt['help_latest_themes'] = 'Здесь отображаются последние и самые популярные темы оформления с сайта <a href="https://wedge.org/" target="_blank" class="new_win">wedge.org</a>. Если темы не отображаются, форум не может подключиться к серверу <a href="https://wedge.org/" target="_blank" class="new_win">wedge.org</a>.';

$txt['help_error_plugin_repo'] = 'При последнем вызове этого репозитория, для проверки обновлений имеющихся у вас плагинов, были обнаружены проблемы с соединением (возможно, этот репозиторий уже не существует). Кроме того, если для подключения требуются имя пользователя и пароль, вы можете повторно ввести данные, чтобы проверить их.';
$txt['help_plugins_repo_active'] = 'Если репозиторий не отмечен как активный, вы всё равно сможете выбрать его для просмотра, но при проверке обновлений этот репозиторий запрашиваться не будет.';
$txt['help_plugins_password_blank'] = 'Ранее для этого репозитория уже был указан пароль, но он шифруется на сервере, поэтому не может быть передан другому человеку.<br><br>Если хотите, можно изменить имя пользователя и/или пароль, введя новые данные — или оставьте эти поля пустыми.';

$txt['help_secret_why_blank'] = 'В целях безопасности ваш пароль и ответ на секретный вопрос хранятся в зашифрованном виде.';
$txt['help_primary_membergroup'] = '
	Wedge позволяет определить основную и дополнительную группы пользователей. Если основная группа не назначена, пользователи будут рассматриваться как <em>Обычные пользователи</em>. Используйте дополнительные группы для назначения дополнительных полномочий.
	<h6>Почему здесь нет группы «Модератор»?</h6>
	«Модератор» — ещё одна виртуальная группа, добавить пользователя в которую можно лишь через <a href="<URL>?action=admin;area=manageboards">специальный интерфейс</a>.';

$txt['help_permissions'] = 'Права доступа ограничивают или разрешают пользователям или группе пользователей пользоваться определенными функциями на форуме.<br><br>Вы можете изменить несколько разделов одновременно, с флажками, или посмотреть на разрешения для определенной группы, нажав «Изменить».';
$txt['help_permissions_board'] = 'Если для раздела выбран режим «Глобальный», это означает, что в нем не определены какие-либо собственные права доступа. «Локальный» раздел, напротив, использует собственные права доступа, которые отличаются от глобальных прав. Это позволяет создавать разделы с индивидуальными правами, отличающимися от прав остальных разделов.';
$txt['help_permissions_quickgroups'] = 'Эта функция позволяет использовать уже предустановленные наборы прав. Например, «стандартный», «ограниченный» — запрещающий, «модератор» — с правами модератора, «технический» — с правами на профилактику.';
$txt['help_permissions_deny'] = 'Эта функция позволяет использовать запрещающие права для пользователей. Можно добавить группу с запрещающими правами для отдельных (избранных) пользователей.<br><br>Используйте данную функцию осторожно.';
$txt['help_permissions_postgroups'] = 'Эта функция позволяет выставить определенные права для групп пользователей, основанных на количестве сообщений. Эти разрешения <em>добавляются</em> к разрешениям обычных групп.';
$txt['help_membergroup_guests'] = 'В группу «Гости» входят пользователи, не зарегистрированные или не авторизовавшиеся на форуме.';
$txt['help_membergroup_regular_members'] = 'Обычные пользователи это все пользователи, которые вошли на форум, но не входят ни в одну из определенных групп пользователей.';
$txt['help_membergroup_administrator'] = 'Администратор имеет доступ к любой функции форума. Изменить права доступа администратору нельзя.';
$txt['help_membergroup_moderator'] = '«Модератор» — специальная группа пользователей, наделенных особыми правами. Чаще всего модератор отвечает за соблюдение пользователями правил сайта. Точный перечень полномочий и обязанностей модератора на каждом сайте свой, но чаще всего полномочия, присвоенные этой группе, применяются к модераторам только <em>в тех разделах, которые они модерируют</em>. За пределами этих разделов модераторы являются такими же пользователями, как и все остальные.';
$txt['help_membergroups'] = 'В Wedge существует два вида групп пользователей:
	<ul class="list">
		<li><strong>Постоянная группа:</strong> В постоянную группу, пользователи автоматически не заносятся. Для того чтобы поместить пользователя в такую группу, администратор форума должен установить необходимую группу в профиле пользователя.</li>
		<li><strong>Группа, основанная на количестве сообщений:</strong> В отличии от постоянной группы, группа, основанная на количестве сообщений, не может быть присвоена администратором пользователю. Пользователи автоматически переходят из группы в группу, набирая необходимое количество сообщений.</li>
	</ul>';

$txt['help_group_text_show'] = 'Выберите, какие заголовки групп должны отображаться на страницах тем и в профиле, прямо под именем пользователя. Wedge может отображать только два заголовки основной группы и группы, основанной на количестве сообщений. По умолчанию отображается только имя основной группы или имя группы после её создания, если для пользователя не задана основная группа.<br><br>Кроме того, можно настроить изображения, представляющие группу (определенное количество звездочек или значок). Видимость значка также может быть настроена.';
$txt['help_show_group_key'] = 'В блоке «Сейчас на форуме» отображаются заголовки групп, выделенные цветом, заданным для этих групп в настройках. Это может быть полезным, например, чтобы пользователи знали, присутствует ли кто-нибудь из модераторов или администраторов сейчас на форуме. Порядок, в котором будут отображаться имена, совпадает с порядком значков, настроенным ниже на этой странице.';

$txt['help_maintenance_rot'] = 'Здесь можно <strong>окончательно</strong> и <strong>бесповоротно</strong> удалить старые темы. Рекомендуется сначала сделать резервную копию базы данных, а затем удалять старые темы.<br><br>Используйте осторожно.';
$txt['help_maintenance_members'] = 'Здесь можно <strong>окончательно</strong> и <strong>бесповоротно</strong> удалить учётные записи пользователей форума. <strong>Категорически</strong> рекомендуется сначала сделать резервную копию базы данных, чтобы быть уверенными что не удалите чего-то лишнего.<br><br>Используйте осторожно.';

$txt['help_avatar_server_stored'] = 'Здесь можно позволить пользователям выбирать аватары из хранящихся на сервере. Они, как правило, расположены в том же месте что и директория для аватаров.<br> Подсказка: если вы создадите поддиректории в директории аватаров, получатся «категории».';
$txt['help_avatar_external'] = 'Если данная опция включена, пользователи смогут указывать прямые URL-адреса на аватары, которые хотят использовать. Однако помните, что слишком большие аватары могут разрушить шаблон вашего форума, приведя к искажению его внешнего вида.';
$txt['help_avatar_download_external'] = 'Эта функция позволяет скачивать аватары с указанных URL-адресов.';
$txt['help_avatar_upload'] = 'Эта опция напоминает параметр «Разрешить пользователям использовать внешние аватары», за тем исключением, что аватары будут загружаться на сервер и уменьшаться согласно выставленным вами настройкам.<br><br>Слишком большое количество аватаров приведет к заметному увеличению занятого пространства, так что используйте эту опцию осторожно.';
$txt['help_avatar_download_png'] = 'Формат PNG, как правило, занимает больше места, но изображения выглядят качественней. Если функция выключена, будет использоваться формат JPEG (Размер файлов меньше, но и качество ниже).';
$txt['help_gravatar_settings'] = 'Граватары — это глобальные аватары, хранящиеся на сайте <a href="http://www.gravatar.com/">Gravatar.com</a>, для использования на различных сайтах.';
$txt['help_gravatarEnabled'] = 'Если эта опция включена, граватары будут доступны пользователям.';
$txt['help_gravatarOverride'] = 'Если эта опция включена, пользователи не смогут загружать или использовать другие аватары на форуме, но будут автоматически использовать граватары.';
$txt['help_gravatarAllowExtraEmail'] = 'Если эта опция включена, пользователи смогут использовать альтернативный адрес электронной почты для граватаров.';
$txt['help_gravatarMaxRating'] = 'При создании граватара пользователи могут указать <a href="https://ru.wikipedia.org/wiki/Система_рейтингов_Американской_киноассоциации" target="_blank">относительную оценку</a> изображения, используемого граватаром. Это указывает на максимальный рейтинг, который будет считаться приемлемым на этом форуме.';
$txt['help_avatar_defaults'] = 'Эти параметры позволяют настроить аватар по умолчанию для пользователей, у которых его нет, а также настроить работу с аватарами забаненных пользователей.';
$txt['help_avatar_banned_hide'] = 'Позволит скрывать аватары забаненных пользователей, как будто их нет.<br><br>Аватары остаются на месте, просто не отображаются.';

$txt['help_disableHostnameLookup'] = 'Это отключит запрос имени хоста пользователя. На некоторых серверах эта функция работает медленно.';

$txt['help_search_weight_frequency'] = 'Здесь можно установить релевантность поиска.<br><br>При выборе опции «Релевантность поиска по количеству сообщений в теме» определяется процент отсеивания сообщений, максимум из которых будут составлять темы с максимальным количеством ответов, содержащих искомое слово или фразу.';
$txt['help_search_weight_age'] = 'При выборе варианта «Релевантность поиска по возрасту последних сообщений» определяется процент отсеивания сообщений, первыми из которых будут составлять темы с последними по времени сообщениями, содержащими искомое слово или фразу.';
$txt['help_search_weight_length'] = 'При выборе варианта «Релевантность поиска по величине темы» определяется процент отсеивания сообщений, первыми из которых будут составлять темы с максимальным количеством сообщений, содержащих искомое слово или фразу.';
$txt['help_search_weight_subject'] = 'При выборе варианта «Релевантность поиска по названию темы сообщений» определяется процент отсеивания сообщений, первыми из которых будут составлять темы, содержащие в названии искомое слово или фразу.';
$txt['help_search_weight_first_message'] = 'При выборе варианта «Релевантность поиска по содержащимся первым сообщениям» определяется процент отсеивания тем, в первых сообщениях которых будет содержаться искомое слово или фраза.';
$txt['help_search_weight_pinned'] = 'Параметры релевантности используются для определения уместности результатов поиска. Измените параметры релевантности, чтобы результаты поиска соответствовали важным вещам для вашего форума. К примеру, новости форума могут иметь высокую важность для релевантности по «возрасту последнего сообщения». Все параметры относительно друг друга должны быть целыми положительными числами.<br><br>Этот параметр следит за закрепленными темами и увеличивает релевантность.';
$txt['help_search'] = 'Здесь производится настройка всех параметров функции поиска.';
$txt['help_search_why_use_index'] = 'Индексирование может намного улучшить работу поиска на вашем форуме. Особенно, когда число сообщений увеличивается, поиск без индексирования занимает больше времени и увеличивает нагрузку на базу данных. Если ваш форум содержит более пятидесяти тысяч сообщений, можно создать индексирование, для уменьшения нагрузки.<br><br>Обратите внимание: индексирование может занимать некоторое место. Полнотекстовое индексирование построено на MySQL-индексировании. Это относительно компактно (приблизительно тот же размер, что и у таблицы с сообщениями), но большинство слов не индексируется, и большинство запросов обрабатываются очень медленно. Выборочное индексирование зачастую занимает больше места (в зависимости от ваших настроек может доходить до 3-х кратного размера таблицы с сообщениями), но это намного быстрее, чем полнотекстовое, и намного стабильнее.';

$txt['help_see_member_ip'] = 'Ваш IP-адрес будет виден только вам и модераторам. Помните, что IP периодически меняется.<br><br>Вы не можете видеть IP-адреса других пользователей, а они не могут видеть ваш.';
$txt['help_whytwoip'] = 'Wedge использует различные методы для обнаружения IP-адресов пользователей. Как правило, оба метода приводят к отображению одного и того же адреса, однако в некоторых случаях может обнаружиться даже несколько адресов. В этом случае в логи записываются оба адреса и в дальнейшем их можно использовать для отслеживания и бана определенных пользователей.';

$txt['help_posts_and_topics'] = '
	<ul class="list">
		<li>
			<strong>Настройкй сообщений</strong><br>
			Изменение некоторых настроек, касающихся отправки и отображения сообщений.
		</li><li>
			<strong>ББ-теги</strong><br>
			Здесь можно выбрать, какие теги можно использовать пользователям.
		</li><li>
			<strong>Нецензурные слова</strong>
			Для очистки форума от нецензурных выражений можно использовать эту функцию. Выбранные слова будут заменены на указанные вами.
		</li><li>
			<strong>Настройки тем</strong>
			Изменение настроек тем. Количество отображаемых тем на странице, включение или выключение прикрепленных тем, количество сообщений для определения темы как популярной или очень популярной и др.
		</li>
	</ul>';
$txt['help_spider_group'] = 'При выборе группы для пауков, когда гость определяется в качестве поискового робота, ему будут автоматически присвоены определенные «запреты» этой группы, в добавление к обычным правам для гостей. Вы можете использовать это для ограничения поисковых роботов при их посещении вашего форума. Можно, например, создать новую группу под названием «Пауки», задать для нее ряд запрещающих параметров (например, просмотр профилей) и выбрать её здесь.<br>Примечание: механизм обнаружения пауков не совершенен и не всегда срабатывает, особенно для тех поисковых систем, которые пока не добавлены.';
$txt['help_show_spider_online'] = 'С помощью этого параметра можно выбрать, кому будут видны пауки (их имена и количество) в списке «Сейчас на форуме». Доступные варианты:
	<ul class="list">
		<li>
			<strong>Ни для кого</strong><br>
			Пауки будут отображаться в виде обычных гостей.
		</li><li>
			<strong>Показывать количество пауков</strong><br>
			На главной странице будет отображено текущее количество находящихся на форуме пауков.
		</li><li>
			<strong>Показывать имена пауков</strong><br>
			Имя каждого паука будет доступно для просмотра любому пользователю, на главной странице и на странице «Сейчас на форуме».
		</li><li>
			<strong>Показывать все сведения, но только админам</strong><br>
			Как указано выше, только администраторы могут видеть статус пауков. Всем остальным пользователям пауки будут представляться в виде гостей.
		</li>
	</ul>';

$txt['help_pm_bcc'] = 'При отправке личного сообщения можно добавить скрытого адресата, который не будет виден остальным адресатам сообщения.';

$txt['help_move_topics_maintenance'] = 'Это позволит переместить все сообщения из одного раздела в другой.';
$txt['help_maintain_reattribute_posts'] = 'Вы можете использовать данную функцию для присвоения сообщений гостей определенным зарегистрированным пользователям форума. Это полезно, если, к примеру, какой-нибудь пользователь сначала удалил свою учётную запись, а потом попросил вернуть ему все его старые сообщения.';
$txt['help_chmod_flags'] = 'Вы можете вручную установить нужные права доступа для выделенных файлов. Для этого введите CHMOD значение (в виде трехзначного числа). Примечание: на Windows-системах это не будет иметь никакого эффекта.';

$txt['help_postmod'] = 'В этой секции модераторы (с достаточным набором прав) могут одобрять любые сообщения и темы перед их публикацией на форуме.';

$txt['help_field_show_enclosed'] = 'Помещает форму для ввода текста пользователем между некоторым текстом или HTML. Это добавляет больше свободы при вводе сообщений, изображений или любых других встраиваемых объектов. Например:<br><br>
		&lt;a href="http://website.com/{INPUT}"&gt;&lt;img src="{DEFAULT_IMAGES_URL}/icon.gif" alt="{INPUT}"&gt;&lt;/a&gt;<br><br>
		Можно использовать следующие переменные:<br>
		<ul class="list">
			<li>{INPUT} - Данные, вводимые пользователем.</li>
			<li>{SCRIPTURL} - Веб-адрес форума.</li>
			<li>{IMAGES_URL} - URL-адрес папки изображений текущей темы оформления.</li>
			<li>{DEFAULT_IMAGES_URL} - URL-адрес папки изображений темы оформления по умолчанию (default).</li>
		</ul>';

$txt['help_custom_mask'] = 'Маска ввода важна для безопасности вашего форума. Проверка при вводе пользователями данных может предотвратить использование этих данных неожиданным для вас образом. В маске используются простые регулярные выражения.<br><br>
	<div style="margin: 0 2em">
		<span class="bbc_tt">/[A-Za-z]+/</span> - Соответствие всем символам алфавита в верхнем и нижнем регистрах.<br>
		<span class="bbc_tt">/[0-9]+/</span> - Соответствие всем числовым символам.<br>
		<span class="bbc_tt">/[A-Za-z0-9]{7}/</span> - Соответствие всем символам алфавита в верхнем и нижнем регистрах, а также семизначным числовым значениям.<br>
		<span class="bbc_tt">/[^0-9]*/</span> - Запрет любого соответствия числовым значениям.<br>
		<span class="bbc_tt">/^([A-Fa-f0-9]{3}|[A-Fa-f0-9]{6})$/</span> - Разрешать только 3 или 6-символьные шестнадцатеричные коды.<br>
	</div><br><br>
	Кроме того, могут быть определены специальные метасимволы ? + * ^ $ \\ и {xx}.
	<div style="margin: 0 2em">
		? - Одно соответствие предыдущему выражению.<br>
		+ - Одно или более соответствий предыдущему выражению.<br>
		* - Ни одного соответствия предыдущему выражению.<br>
		{xx} - Точное число из предыдущего выражения.<br>
		{xx,} - Точное число или больше из предыдущего выражения.<br>
		{,xx} - Точное число или меньше из предыдущего выражения.<br>
		{xx,yy} - Точное соответствие между двумя числами из предыдущего выражения.<br>
		^ - Начало строки.<br>
		$ - Конец строки.<br>
		\ - Экранирует следующий символ.<br>
	</div><br><br>
	Дополнительную информацию по данному вопросу можно найти в интернете.';

$txt['help_reverse_proxy'] = 'При использовании анализатора плохого поведения вслед за обратным прокси, балансировкой нагрузки, HTTP-ускорителем, кэшем контента или похожей технологией, включите этот параметр.';
$txt['help_reverse_proxy_header'] = 'Обратный прокси-сервер должен установить IP-адрес клиента, от которого он получил запрос в заголовке HTTP. Как правило, используется заголовок <a href="http://en.wikipedia.org/wiki/X-Forwarded-For">X-Forwarded-For</a>, поскольку он поддерживается большинством прокси-серверов, хотя вам всё-таки нужно убедиться, что этот заголовок включен на ваших прокси-серверах. К наиболее распространенным заголовкам ещё относятся «X-Real-Ip» (nginx) и «Cf-Connecting-Ip» (CloudFlare).';
$txt['help_reverse_proxy_ips'] = 'Здесь нужно перечислить IP-адреса (например, 127.0.0.1) или блоки в формате межклассовой адресации (например, 127.0.0.0/8). Если у вас есть цепочка из двух или более обратных прокси между вашим сервером и интернетом, вы должны указать <em>все</em> диапазоны IP-адресов (в формате CIDR) всех ваших прокси-серверов, балансировщиков нагрузки и т. д. В противном случае может оказаться невозможным определить истинный IP-адрес клиента.';

$txt['help_signature_minposts'] = 'В то время как некоторые сайты могут использовать разрешения для управления подписями, другие могут разрешить пользователям добавлять подписи, но не показывать их другим пользователям. Это может обеспечить дополнительное сдерживание против спамеров.';

$txt['help_media_permissions'] = 'Здесь можно добавлять/изменять/удалять различные профили разрешений. Эти профили могут быть назначены одному или нескольким альбомам.';

// Help popup for the Media tag...
$txt['help_mediatag'] = '<h2>О теге [media]</h2>
	Создан, чтобы упростить пользователям встраивание элементов в сообщениях форума (везде, где поддерживаются ББ-теги).
	Вот несколько примеров:
	<br><br><b>[media id=123 type=preview align=center width=400 caption="Привет, мир!"]</b>
	<br>Демонстрация превью картинки, с выравниванием по центру сообщения и масштабированием до 400 пикселей по ширине, с указанным заголовком (caption). Все параметры, кроме ID, не обязательны.
	<br>
	<br><b>[media id=1,2 type=album]</b>
	<br>Демонстрация последних элементов из ваших первых двух альбомов. Они будут показаны с использованием типа box (см. ниже).
	<br><br>
	<b>Возможные значения:</b>
	<br>- type=<em>normal, box, link, preview, full, album</em> (тип)
	<br>- align=<em>none, left, center, right</em> (выравнивание элемента)
	<br>- width=<em>123</em> (ширина в пикселях)
	<br>- caption=<em>"Текст заголовка"</em> или caption=<em>ЗаголовокОднимСловом</em>
	<br><br>
	<h2>Доступные параметры</h2>
	<b>id</b> <i>(идентификатор)</i>
	<ul class="list">
		<li>Все элементы идентифицируются по специальному номеру, который можно увидеть в строке адреса. Используйте этот номер здесь. Это единственный <b>ОБЯЗАТЕЛЬНЫЙ</b> параметр.
		Можно указать несколько значений, через запятую "[media id=1,2,3 type=album]".</li>
	</ul>
	<br>
	<b>type</b> <i>(тип)</i>
	<ul class="list">
		<li><b>normal</b> (по умолчанию) — отображает эскиз. Кликните на нем для показа превью.</li>
		<li><b>av</b> — отображает плеер для показа видеофайла или воспроизведения аудиотрека. Если не указать этот параметр, будет отображен эскиз элемента, но при клике на него начнется загрузка файла (вместо просмотра).</li>
		<li><b>box</b> — отображает информационный блок с эскизом как в альбоме. При клике на эскиз происходит перенаправление на страницу элемента.</li>
		<li><b>link</b> — похож на параметр по умолчанию (normal), но если параметр <b>caption</b> указан, то подпись будет ссылкой на страницу элемента.</li>
		<li><b>preview</b> — отображает некликабельный превью изображения (больше эскиза, но меньше оригинала).</li>
		<li><b>full</b> — отображает оригинальное изображение. Убедитесь, что установлен параметр <b>width</b>!</li>
		<li><b>album</b> — отображает последние элементы альбома (требуется указать id). Элементы будут показаны с использованием типа <b>box</b>.</li>
	</ul>
	<br>
	<b>align</b> <i>(выравнивание)</i>
	<ul class="list">
		<li><b>none</b> (по умолчанию) — без выравнивния (элементы справа и слева не разрешены).</li>
		<li><b>left</b> — выравнивание по левому краю. Использование параметра <b>left</b> в нескольких тегах [media] отобразит элементы рядом друг с другом.</li>
		<li><b>center</b> — выравнивание по центру. Возможно совместное использование. Например, в таком порядке: [media align=left][media align=right][media align=center]</li>
		<li><b>right</b> — выравнивание по правому краю. (См. описание <i>left</i>).</li>
	</ul>
	<br>
	<b>width</b> <i>(ширина)</i>
	<ul class="list">
		<li>Any number higher than zero will do. This parameter is only needed if you want to force a specific width.</li>
		<li>Set the tag type according to the desired size. For instance, if your thumbnails have a default width of 120, and previews are 500 pixels wide, use [media type=preview] if you\'re forcing a width of 300 to 500 pixels, otherwise the resulting thumbnail will be very blurry.</li>
	</ul>
	<br>
	<b>caption</b> <i>(подпись)</i>
	<ul class="list">
		<li>Отображает подпись (если параметр <b>type</b> установлен в <i>link</i>, то подпись будет ссылкой на страницу элемента).</li>
		<li>Можно указать любое слово или текст. Если в подписи присутствуют пробелы или скобки, необходимо заключить текст в &quot;двойные кавычки&quot;.</li>
	</ul>';

$txt['help_contacts'] = 'Контакты — простой способ сортировать друзей по категориям. Можно использовать эти списки в качестве конкретных настроек конфиденциальности, что позволяет очень точно определить, кто может видеть то, чем вы делитесь.
	<br>Разумеется, можно поместить кого-угодно в несколько списков.
	<br><br>
	Есть несколько общих типов списков на выбор; вы также можете создавать новые списки или переименовывать существующие.
	<br>- <strong>Друзья</strong>: обычно это наиболее близки к вам люди.
	<br>- <strong>Знакомые</strong>: люди, с которыми вы так или иначе связаны, но не уверены, что хотите поделиться всем.
	<br>- <strong>Коллеги</strong>: люди, с которыми вы работаете вместе.
	<br>- <strong>Семья</strong>: ваши родители, братья и сестры и т. д.
	<br>- <strong>Подписчики</strong>: все, кого вы может и не знаете лично, но у вас могут найтись общие знакомые.
	<br>- <strong>Игнорируемые</strong>: фактически это специальный список нежелательных контактов; они не смогут получить доступ к вашему защищенному контенту, даже если они также находятся в авторизованном списке. Только вы можете видеть, кто состоит в этом списке.';
