<?php
// Version: 2.0; Home
// This is a sample file.

$txt['home_title'] = 'Это мы.';
$txt['home_intro'] = '
			Данный форум работает на Wedge, программной платформе, написанной на PHP 5.
			<br><br>
			<em>Чтобы изменить этот текст, скопируйте следующие файлы:
			core/app/Home.php, core/html/Home.template.php, core/languages/Home.*.php.
			Сделайте им другой префикс, например, MyHome. Примените свои изменения
			к этим файлам, затем загрузите их и поменяйте в настройках Wedge
			главную страницу на MyHome (параметр default_index в таблице settings).
			<br>
			Эти несложные манипуляции позволят использовать несколько переводов данного текста,
			не опасаясь потери измененных файлов после очередного обновления Wedge.</em>';
