<?php
// Version: 2.0; ManagePlugins

$txt['plugin_manager_desc'] = 'Здесь можно управлять имеющимися плагинами.';

$txt['fatal_not_valid_plugin'] = 'Указанный плагин не может быть включен, потому что он, кажется, отсутствует или поврежден.';
$txt['fatal_not_valid_plugin_remove'] = 'Указанный плагин не может быть удален, так как он, кажется, поврежден.';
$txt['install_errors'] = 'Этот плагин не может быть использован, потому что:';
$txt['fatal_already_enabled'] = 'Этот плагин уже включен.';
$txt['fatal_already_disabled'] = 'Этот плагин уже отключен.';
$txt['install_error_minphp'] = 'Требуется версия PHP %1$s (текущая — %2$s)';
$txt['fatal_install_error_minphp'] = 'Этот плагин не может быть установлен, он требует PHP версии %1$s, но на этом сервере установлена только версия %2$s.';
$txt['install_error_minmysql'] = 'Требуется версия MySQL %1$s (текущая — %2$s)';
$txt['fatal_install_error_minmysql'] = 'Этот плагин не может быть установлен, он требует MySQL версии %1$s, но на этом сервере установлена только версия %2$s.';
$txt['install_error_missinghook'] = 'Одна или несколько функций, необходимых для этого плагина, недоступны.';
$txt['install_error_reqfunc'] = 'Эта функция требует, чтобы были доступны следующие функции PHP: %1$s';
$txt['install_error_duplicate_id'] = 'Другой плагин с такой же идентификацией уже включен.';
$txt['fatal_duplicate_id'] = 'Другой плагин с таким же идентификатором уже включен (возможно, другая версия того же плагина). Отключите его, прежде чем включать этот плагин.';
$txt['install_error_maint_mode'] = 'Для установки этого плагина необходимо перейти в режим обслуживания.';
$txt['fatal_install_error_maint_mode'] = 'Этот плагин должен произвести масштабные изменения базы данных. Чтобы сделать этот процесс проще и быстрее, плагин не запустится, пока форум не будет переведен в режим обслуживания.';
$txt['fatal_remove_error_maint_mode'] = 'Этот плагин произвел масштабные изменения базы данных при установке. Для его удаления необходимо перевести форум в режим обслуживания.';
$txt['fatal_install_error_reqfunc'] = 'Этот плагин использует функции, не поддерживаемые текущими установками PHP: %1$s. Для получения дополнительной информации обратитесь в поддержку хостинга.';
$txt['fatal_install_error_missinghook'] = 'Этот плагин использует функции, недоступные в данный момент: %1$s. Попробуйте связаться с автором плагина.';
$txt['fatal_install_enable_missing'] = 'Этот плагин указывает, что определенный файл содержит инструкции, которые должны быть выполнены при его включении (%1$s), но файл не может быть найден по указанному плагином пути.';
$txt['fatal_install_disable_missing'] = 'Этот плагин указывает, что определенный файл содержит инструкции, которые должны быть выполнены при его отключении (%1$s), но файл не может быть найден по указанному плагином пути.';
$txt['fatal_install_remove_missing'] = 'Этот плагин указывает, что определенный файл содержит инструкции, которые должны быть выполнены при его удалении (%1$s), но файл не может быть найден по указанному плагином пути.';
$txt['fatal_conflicted_plugins'] = 'Этот плагин предоставляет возможности для других плагинов. Вы не можете отключить его без отключения следующих плагинов: %1$s';
$txt['no_plugins_found'] = 'Плагины не найдены.';

$txt['plugin_written_by'] = 'Автор';
$txt['plugin_author_url'] = 'Сайт';
$txt['plugin_website'] = 'Посетить сайт %1$s';
$txt['plugin_author_email'] = 'E-mail';
$txt['plugin_readmes'] = 'Информация';

$txt['invalid_plugin_readme'] = 'Не удалось найти подходящий файл readme для этого плагина.';
$txt['enable_plugin'] = 'Включить плагин';
$txt['disable_plugin'] = 'Отключить плагин';
$txt['remove_plugin'] = 'Удалить плагин';

$txt['remove_plugin_desc'] = 'Вы выбрали, что хотите удалить плагин: %1$s.';
$txt['remove_plugin_blurb'] = 'Есть два способа удаления плагина.';
$txt['remove_plugin_nodelete'] = 'С сохранением данных';
$txt['remove_plugin_nodelete_desc'] = 'Плагин и его файлы будут удалены, но все данные и настройки будут сохранены. Для получения дополнительной информации о том, что будет сохранено, пожалуйста, свяжитесь с автором плагина.';
$txt['remove_plugin_delete'] = 'С удалением данных';
$txt['remove_plugin_delete_desc'] = 'Плагин, его данные и настройки будут <strong>удалены</strong>. Отменить это будет нельзя! <strong>Выберите это, если вы уверены, что не хотите использовать этот плагин в дальнейшем.</strong>';
$txt['remove_plugin_unsure'] = 'Если не уверены, хотите сохранить данные или нет, выберите вариант «С удалением данных».';
$txt['remove_plugin_already_enabled'] = 'Этот плагин сейчас включен. Отключите его, прежде чем удалять.';
$txt['remove_plugin_files_still_there'] = 'Файлы плагина не могут быть удалены. Для удаления папки %1$s может потребоваться войти на сервер с помощью FTP.';
$txt['remove_plugin_files_pre_still_there'] = 'Плагин ещё не был удален; файлы плагина не могут быть удалены без изменения прав доступа (надо сделать их удаляемыми).';
$txt['remove_plugin_maint'] = 'Этот плагин требует, чтобы форум был в режиме обслуживания, чтобы произвести масштабные изменения в базе данных при удалении.';

$txt['plugin_filter'] = 'Фильтр:';
$txt['plugin_filter_all'] = 'Все (%1$d)';
$txt['plugin_filter_enabled'] = 'Включенные (%1$d)';
$txt['plugin_filter_disabled'] = 'Выключенные (%1$d)';
$txt['plugin_filter_install_errors'] = 'Несовместимые (%1$d)';

$txt['could_not_connect_remote'] = 'Wedge не удалось войти на сервер для выполнения изменений.<br>Сервер вернул следующую ошибку: %1$s<br><br>Вы можете попробовать вернуться и проверить предоставленные данные для входа.';

$txt['plugins_no_gzinflate'] = 'Ваш сервер не поддерживает gzinflate, поэтому возможности загрузки/выгрузки плагинов не доступны. На хостинге должна быть включена поддержка zlib для PHP.';
$txt['plugins_add_desc'] = 'Здесь можно добавлять новые плагины на форум.';
$txt['plugins_add_download'] = 'Загрузка плагина из репозитория';
$txt['plugins_add_download_desc'] = 'Есть репозитории, которые содержат различные плагины для Wedge. Попробуйте найти подходящие плагины.';
$txt['plugins_repository'] = 'Репозиторий';
$txt['plugins_active'] = 'Активен';
$txt['plugins_browse'] = 'Обзор';
$txt['plugins_modify'] = 'Изменить';
$txt['plugins_no_repos'] = 'Нет репозиториев в списке.';
$txt['plugins_add_repo'] = 'Добавить репозиторий';
$txt['plugins_repo_auth'] = 'При обращении в этот репозиторий будут предоставлены данные для входа в него.';
$txt['plugins_repo_error'] = 'Ошибка';
$txt['plugins_add_upload'] = 'Загрузка плагина с компьютера';
$txt['plugins_add_upload_desc'] = 'Вы можете использовать эту функцию для загрузки плагина в формате .zip на форум.';
$txt['plugins_add_upload_file'] = 'Файл плагина для загрузки:';
$txt['plugins_upload_plugin'] = 'Загрузить плагин';

$txt['plugins_browse_invalid_error'] = 'Вы пытались просмотреть несуществующий репозиторий.';
$txt['plugins_browse_could_not_connect'] = 'Не удалось найти выбранный репозиторий; он может быть временно недоступен. Вы можете просмотреть его вручную по ссылке: <a href="%1$s">%1$s</a>';

$txt['plugins_edit_repo'] = 'Редактировать репозиторий';
$txt['plugins_edit_repo_desc'] = 'На этой странице можно указать сведения о дополнительных репозиториях для подключаемых плагинов.';
$txt['plugins_edit_invalid'] = 'Вы пытались отредактировать несуществующий репозиторий. Добавьте новый.';
$txt['plugins_edit_invalid_error'] = 'Вы пытались отредактировать несуществующий репозиторий.';
$txt['plugins_repo_details'] = 'Сведения о репозитории';
$txt['plugins_repo_details_desc'] = 'Репозиторию требуются имя и адрес, и, при необходимости, вы также можете указать имя пользователя и пароль, которые будут использоваться при обращении в репозиторий для получения плагинов.';

$txt['plugins_repo_name'] = 'Имя репозитория';
$txt['plugins_repo_address'] = 'Адрес репозитория';
$txt['plugins_repo_active'] = 'Репозиторий активен';
$txt['plugins_repo_delete'] = 'Удалить';
$txt['plugins_repo_delete_confirm'] = 'Хотите удалить этот репозиторий? Отменить операцию будет нельзя.';

$txt['plugins_repo_auth'] = 'Детали авторизации';
$txt['plugins_repo_auth_desc'] = 'Если для этого репозитория требуются имя пользователя и пароль, укажите их здесь. Если данные авторизации не используются, оставьте оба поля пустыми.';
$txt['plugins_repo_username'] = 'Имя пользователя';
$txt['plugins_repo_password'] = 'Пароль';
$txt['plugins_repo_password_blank'] = 'Почему здесь пусто?';

$txt['plugins_repo_no_name'] = 'Имя репозитория не было указано; это обязательно.';
$txt['plugins_repo_no_url'] = 'Адрес репозитория не был указан; это обязательно.';
$txt['plugins_repo_invalid_url'] = 'Адрес, указанный для репозитория, недопустим. Проверьте ещё раз и повторите попытку.';
$txt['plugins_auth_pwd_nouser'] = 'Вы предоставили пароль для репозитория, но не указали имя пользователя — необходимо предоставить оба параметра.';
$txt['plugins_auth_diffuser'] = 'Вы указали имя пользователя, но не указали пароль — необходимо предоставить оба параметра.';

$txt['plugins_invalid_upload'] = 'Вы, кажется, пытались загрузить плагин, но файл не может быть сохранен. Возможно, его размер превышает установленные ограничения. Помните: плагин всегда можно распаковать на компьютере и загрузить через FTP или SFTP в директорию плагинов форума.';
$txt['plugins_unable_read'] = 'Плагин был загружен, но по какой-то причине Wedge не смог прочитать информацию. Это может быть вызвано необычной конфигурацией хоста, и может означать, что вам придется загружать плагины в директорию плагинов форума через FTP или SFTP, а не через веб-интерфейс.';
$txt['plugins_unable_write'] = 'Плагин был загружен, но по какой-то причине Wedge не смог распаковать файлы плагина на сервер. Это может быть вызвано необычной конфигурацией хоста, и может означать, что вам придется загружать плагины в директорию плагинов форума через FTP или SFTP, а не через веб-интерфейс.';
$txt['plugins_invalid_zip'] = 'Плагин был загружен, но по какой-то причине ZIP-файл кажется недействительным и не может быть распакован. Вы можете попробовать повторно загрузить плагин, или же вы можете распаковать его вручную на свой компьютер, а затем загрузить в директорию плагинов форума через FTP или SFTP.';
$txt['plugins_generic_error'] = 'Плагин был загружен, но, к сожалению, что-то пошло не так. Обратитесь на форум поддержки Wedge и используйте ссылку %1$s:%2$s при описании проблемы.';
$txt['plugins_invalid_plugin_no_info'] = 'Плагин был загружен, но он не содержит действительного файла plugin-info.xml, необходимого Wedge. Обратитесь к автору плагина для поддержки.';
$txt['plugins_invalid_plugin_overinfo'] = 'Плагин был загружен, но он содержит несколько файлов plugin-info.xml, и Wedge не знает, с каким из них следует работать. Обратитесь к автору плагина для поддержки.';
$txt['plugins_uploaded_error'] = 'С момента загрузки плагина возникла проблема. Пожалуйста, попробуйте загрузить его снова.';
$txt['plugins_uploaded_tampering'] = 'Возникла проблема с загруженным вами плагином; есть некоторые признаки того, что он, возможно, был подделан и поэтому был удален для вашей защиты.';

$txt['plugin_duplicate_detected_title'] = 'Обнаружен дубликат плагина';
$txt['plugin_duplicate_detected'] = 'Загруженный плагин ($1$s) является дубликатом существующего плагина, уже активного на вашем сайте (%2$s). Что будем делать?';
$txt['plugin_duplicate_cancel'] = 'Не хочу ничего делать прямо сейчас';
$txt['plugin_duplicate_cancel_desc'] = 'Существующий плагин останется установленным, а только что загруженный файл будет удален.';
$txt['plugin_duplicate_proceed'] = 'Хочу заменить свой старый плагин на новый';
$txt['plugin_duplicate_proceed_desc'] = 'Существующий плагин будет отключен, а его файлы (но не его данные) удалены, а новый будет распакован, чтобы вы снова включили его.';

$txt['plugin_upload_successful_title'] = 'Загрузка успешна';
$txt['plugin_upload_successful'] = 'Файл плагина был успешно загружен и пока что действителен. Далее Wedge начнет процесс распаковки плагина. Это можно сделать в несколько шагов, чтобы снизить нагрузку на сервер.';

$txt['plugin_connection_successful_title'] = 'Соединение успешно';
$txt['plugin_connection_successful'] = 'Предоставленные данные для вашего сервера кажутся верными, поэтому теперь мы можем перейти к следующему этапу загрузки.';

$txt['plugin_connection_details_title'] = 'Детали соединения';
$txt['plugin_connection_details'] = 'Для продолжения установки плагина Wedge требуются данные FTP или SFTP.';
$txt['plugin_connection_cancel_oops'] = 'Хм...';
$txt['plugin_connection_cancel'] = 'В случае, если ваш хостер не предоставил вам FTP или SFTP-доступ, вы не сможете использовать веб-интерфейс. В этом случае нужно узнать о других способах управления файлами (например, через панель управления хостингом).';
$txt['plugin_connection_button'] = 'У меня нет этого';
$txt['plugin_connection_required'] = 'Wedge предполагает, что у вас есть следующие данные.';

$txt['plugin_connection'] = 'Это мои данные';
$txt['plugin_ftp_server'] = 'Сервер:';
$txt['plugin_ftp_port'] = 'Порт:';
$txt['plugin_ftp_username'] = 'Имя пользователя:';
$txt['plugin_ftp_password'] = 'Пароль:';
$txt['plugin_ftp_type'] = 'Тип соединения:';
$txt['plugin_ftp_path'] = 'Путь к директории плагинов:';
$txt['plugin_ftp_save'] = 'Сохраните эти сведения для последующего использования';
$txt['plugin_ftp_error'] = 'Предоставленные данные были неверными:';
$txt['plugin_ftp_error_bad_server'] = 'Предоставленный сервер кажется неправильным.';
$txt['plugin_ftp_error_bad_response'] = 'После обращения к FTP-серверу был странный ответ от него; попробуйте ещё раз позже.';
$txt['plugin_ftp_error_bad_username'] = 'Предоставленный логин оказался неверным.';
$txt['plugin_ftp_error_bad_password'] = 'Неверный пароль.';
$txt['plugin_ftp_error_wrong_folder'] = 'Предоставленная папка была неправильной, и все попытки найти правильную папку завершились неудачно.';

$txt['plugin_files_pruned_title'] = 'Старый плагин удален';
$txt['plugin_files_pruned'] = 'Старый плагин был успешно удален. Wedge теперь начнет устанавливать новый плагин.';

$txt['plugin_folders_created_title'] = 'Директории соданы';
$txt['plugin_folders_created'] = 'Перед распаковкой файлов Wedge должен был добавить все соответствующие папки для файлов в плагине. Всё, что теперь остаётся — загрузить файлы.';

$txt['plugin_files_unpacked_title'] = 'Файлы распакованы';
$txt['plugin_files_unpacked'] = 'Все файлы распакованы. Теперь вы можете включить плагин!';
