<?php
// Version: 2.0; ManagePosts

// Post Settings
$txt['removeNestedQuotes'] = 'Удалять вложенные цитаты при отправке сообщения';
$txt['enableEmbeddedFlash'] = 'Разрешить Flash в сообщениях';
$txt['enableEmbeddedFlash_warning'] = 'Может возникнуть угроза безопасности!';
$txt['additional_options_collapsable'] = 'Разрешить сворачивать дополнительные настройки отправки сообщений';

$txt['max_subjectLength'] = 'Максимальный размер заголовка';
$txt['max_subjectLength_zero'] = '0 — без ограничений. Внимание: для значений > 255 символов необходимо изменить таблицу сообщений.';
$txt['max_messageLength'] = 'Максимальный размер сообщения';
$txt['max_messageLength_zero'] = '0 — без ограничений';
$txt['topicSummaryPosts'] = 'Количество отображаемых сообщений под полной формой ответа';

$txt['max_image_width'] = 'Максимальная ширина прикрепляемых изображений (0 = отключить)';
$txt['max_image_height'] = 'Максимальная высота прикрепляемых изображений (0 = отключить)';

$txt['spamWaitTime'] = 'Время между отправкой сообщений с одного IP';
$txt['edit_wait_time'] = 'Время редактирования сообщения';
$txt['edit_disable_time'] = 'Время, в течение которого разрешено редактировать сообщение';
$txt['edit_disable_time_zero'] = '0 — без ограничений';
$txt['allow_non_mod_edit'] = 'Разрешить пользователям вносить изменения в сообщения после правок модераторов?';

// Topic Settings
$txt['enableParticipation'] = 'Показывать специальные иконки напротив тем с сообщениями пользователя';

$txt['correctExclamations'] = 'Исправлять слишком много восклицаний в заголовке';
$txt['correctShouting'] = 'Максимальный % заглавных букв в заголовке';

$txt['oldTopicDays'] = 'Время, после которого тема считается устаревшей';
$txt['oldTopicDays_zero'] = '0 — отключено';
$txt['defaultMaxTopics'] = 'Количество тем на странице';
$txt['defaultMaxMessages'] = 'Количество сообщений на странице темы';

$txt['enableAllMessages'] = 'Максимальный размер темы для отображения ссылки «Все»';
$txt['enableAllMessages_zero'] = '0 — никогда не показывать ссылку «Все»';
$txt['disableCustomPerPage'] = 'Запретить индивидуальную настройку количества тем/сообщений на странице';
$txt['enablePreviousNext'] = 'Показывать ссылки «предыдущая тема/следующая тема»';

$txt['ignoreMoveVsNew'] = 'При перемещении тем разрешить перенос в любой раздел по умолчанию';

// Bulletin Board Code
$txt['enableBBC'] = 'Разрешить ББ-теги';
$txt['enablePostHTML'] = 'Разрешить <em>основной</em> HTML в сообщениях';
$txt['autoLinkUrls'] = 'Автоматически вставлять ссылки URL';

$txt['disabledBBC'] = 'Разрешенные ББ-теги';
$txt['bbcTagsToUse'] = 'Разрешить ББ-теги';
$txt['bbcTagsToUse_select'] = 'Выберите теги, которые можно использовать';
$txt['bbcTagsToUse_select_all'] = 'Выбрать все теги';

// Post Editor
$txt['disable_wysiwyg'] = 'Запретить редактор WYSIWYG';
$txt['editorSizes'] = 'Размеры шрифтов, доступные в редакторе';
$txt['editorSizes_subtext'] = 'По одному в строку';
$txt['editorFonts'] = 'Шрифты, доступные в редакторе';
$txt['editorFonts_subtext'] = 'Хотя вы можете указать здесь любой шрифт, и он будет отображатьсяя в редакторе в выпадающем списке «Шрифт», он будет работать только в том случае, если установлен на компьютерах пользователей.';

// Censored Words
$txt['admin_censored_where'] = 'Напишите в левом поле нецензурное слово, а в правом — его замену.';
$txt['censor_whole_words'] = 'Только слова целиком';
$txt['censor_case'] = 'Не учитывать регистр букв';
$txt['allow_no_censored'] = 'Разрешить пользователям выключать цензуру';

$txt['censor_test'] = 'Тестировать нецензурные слова';
$txt['censor_test_save'] = 'Тестировать';

// Draft Settings
$txt['masterSavePostDrafts'] = 'Разрешить сохранение черновиков сообщений';
$txt['draftsave_subnote'] = 'Обратите внимание, что пользователям необходимо выдать соответствующие права доступа.';
$txt['masterAutoSavePostDrafts'] = 'Разрешить автоматическое сохранение черновиков сообщений';
$txt['draftautosave_subnote'] = 'Это не отменяет опцию выше, а лишь дополняет её. Кроме того, пользователи должны иметь соответствующие права доступа.';
$txt['masterAutoSaveDraftsDelay'] = 'Частота автоматических сохранений';
$txt['pruneSaveDrafts'] = 'Через сколько дней удалять сохраненные черновики';

// Merging
$txt['merge_post_header'] = 'Объединение идущих подряд сообщений от одного автора';
$txt['merge_post_auto'] = 'Автоматическое объединение';
$txt['merge_post_auto_time'] = 'Задержка, после которой сообщения больше не объединяются автоматически.';
$txt['merge_post_auto_time_subtext'] = '(В секундах; установите 0, чтобы объединять всегда)';

$txt['merge_post_admin_double_post'] = 'Объединять и сообщения администраторов в том числе';

$txt['merge_post_no_time'] = 'Не показывать старую дату сообщения перед разделителем';
$txt['merge_post_no_sep'] = 'Не показывать ни разделитель, ни старую дату сообщения.';
$txt['merge_post_separator'] = 'Разделитель между объединенными сообщениями (включите параметр выше.)';
$txt['merge_post_separator_subtext'] = 'Можно использовать ББ-теги. Старая дата сообщения выводится через переменную <strong>$date</strong>.<br>По умолчанию это выглядит так: [size=1]$date[/size][hr][br]';
$txt['merge_post_custom_separator'] = 'Использование пользовательского разделителя между объединенными сообщениями.';
$txt['merge_post_custom_separator_subtext'] = 'Настройки выше будут отключены.';

$txt['merge_post_ignore_length'] = 'Игнорировать максимальную длину сообщений';
