<?php

$txt['http_error'] = 'Ошибка HTTP';

// Titles for the errors
$txt['behav_400'] = 'Неверный запрос!';
$txt['behav_403'] = 'Доступ запрещён.';
$txt['behav_417'] = 'Ожидание не удалось.';

$txt['behavior_admin'] = 'Ошибка безопасности';
$txt['behavior_header'] = 'Приносим извинения за неудобства, но мы не можем выполнить ваш запрос; в рамках защиты от распространения нежелательной почты и вредоносных программ защита данного сайта обнаружила потенциально подозрительное поведение, соответствующее поведению известных распространителей спама и/или вредоносных программ. К счастью, проблему легко исправить.<br><br>Информация предоставлена системой <a href="http://bad-behavior.ioerror.us/">Bad Behavior</a>.';

$txt['behavior_false_ua'] = 'При каждом запросе, отправляемом вашим браузером, он должен посылать строку User-Agent, чтобы идентифицировать себя на сервере. User-agent, указанный в этом запросе, был ложным; если вы сбросите его на то, что браузер должен отправить, вы сможете получить доступ к этому сайту.';
$txt['behavior_misconfigured_proxy'] = 'Эта проблема часто связана с прокси-серверами и системами, которые не настроены должным образом. Обычно вам нужно полностью удалить используемое программное обеспечение, так как простое отключение не действует. Обратитесь к администратору сервера.';
$txt['behavior_misconfigured_privacy'] = 'Эта проблема может произойти, когда есть программное обеспечение конфиденциальности браузера или программное обеспечение персонального брандмауэра, которое не было настроено должным образом, или имеет ошибки. Если вы используете что-то вроде этого, вам нужно либо отключить его, либо изменить его настройки, прежде чем пытаться снова. (Пример: если вы используете Norton Internet Security, он имеет функцию просмотра в скрытом режиме, которая препятствует нормальной работе в Интернете.)';
$txt['behavior_malware'] = 'Эта проблема может быть вызвана вирусами или шпионскими программами на вашем компьютере или вредоносными программами, которые выдают себя за антивирусные или антишпионские программы. Убедитесь, что на вашем компьютере установлено реальное антивирусное и шпионское программное обеспечение, что оно постоянно обновляется и что вы запустили полную проверку системы с помощью каждого инструмента. Как только ваша система будет очищена от вирусов и шпионских программ, повторите попытку.<br><br>Если под рукой нет других инструментов, может пригодиться бесплатный <a href="http://www.microsoft.com/security_essentials/">Microsoft Security Essentials</a>, но полную защиту он не обеспечит.';
$txt['behavior_opera_bug'] = 'Некоторые старые версии браузера Opera демонстрируют такое поведение; пожалуйста, обновите используемую версию.';
$txt['behavior_chrome_bug'] = 'Некоторые версии Chrome имеют дефект дизайна, который может вызвать этот баг. Способ обхода - очистить историю просмотра, а затем перезагрузить страницу.';

$txt['behavior_footer'] = 'Если вышеуказанные шаги не помогут, свяжитесь с веб-мастером по электронной почте: {email_address} и укажите номер инцидента {incident}.';
// Begin the rules as defined in Security.php
// Each rule has a _desc (the text to use, complete with <br> as appropriate) and _log (the text to display in the admin log)

$txt['behav_blacklist_desc'] = 'У вас нет разрешения на доступ к этому серверу.';
$txt['behav_blacklist_log'] = 'Предоставленный user-agent включен в чёрный список';

$txt['behav_not_cloudflare_desc'] = 'У вас нет разрешения на доступ к этому серверу.';
$txt['behav_not_cloudflare_log'] = 'User-agent идентифицировал себя как CloudFlare, но не может обосновать требования.';

$txt['behav_expect_header_desc'] = 'Запрос содержал ожидание, к сожалению, это не удалось - повторите запрос. Это в основном связано с программным обеспечением, которое запретило доступ к этому сайту из-за наблюдаемой вредоносной активности. Рекомендуется удалить его и связаться с автором; в то же время используемый браузер должен быть подходящим, таким как Firefox, Chrome, Опера, Internet Explorer или Safari.';
$txt['behav_expect_header_log'] = 'Запрос содержал заголовок «Expect»; просил повторной отправки.';

$txt['behav_no_ua_in_post_desc'] = 'Ваш браузер отправил запрос на неверную страницу.';
$txt['behav_no_ua_in_post_log'] = 'User-agent не идентифицировал себя, требуется для отправки.';

$txt['behav_content_range_desc'] = 'Ваш браузер отправил запрос на неверную страницу.';
$txt['behav_content_range_log'] = 'Запрос содержал заголовки «Range» или «Content-Range», хотя не должен содержать их.';

$txt['behav_empty_refer_desc'] = 'Ваш браузер отправил запрос на неверную страницу.';
$txt['behav_empty_refer_log'] = 'В запросе был указан «Referer», но значение было пустым.';

$txt['behav_invalid_refer_desc'] = 'Ваш браузер отправил запрос на неверную страницу.';
$txt['behav_invalid_refer_log'] = 'В запросе был указан «Referer», но значение было повреждено.';

$txt['behav_alive_close_desc'] = 'Ваш браузер отправил запрос на неверную страницу.';
$txt['behav_alive_close_log'] = 'В запросе был указан «Connection», но содержит недопустимые значения';

$txt['behav_wrong_keep_alive_desc'] = 'Ваш браузер отправил запрос на неверную страницу.';
$txt['behav_wrong_keep_alive_log'] = 'В запросе был указан «Keep-Alive», но форма повреждена.';

$txt['behav_rogue_chars_desc'] = 'У вас нет разрешения на доступ к этому серверу. В запросе найдена вредоносная информация.';
$txt['behav_rogue_chars_log'] = 'В запросе найден вредоносный код.';

$txt['behav_invalid_via_desc'] = 'Похоже, вы используете прокси-сервер, который здесь не разрешен.';
$txt['behav_invalid_via_log'] = 'Запрос содержал недопустимый заголовок «via».';

$txt['behav_banned_via_proxy_desc'] = 'Кажется, вы используете прокси-сервер, который здесь не разрешен.';
$txt['behav_banned_via_proxy_log'] = 'Запрос от запрещенного прокси-сервера.';

$txt['behav_banned_xaa_proxy_desc'] = 'Кажется, вы используете прокси-сервер, который здесь не разрешен.';
$txt['behav_banned_xaa_proxy_log'] = 'Найдены неверные заголовки «X-Aaaaaaaaaa» или «X-Aaaaaaaaaaaa».';

$txt['behav_bot_rfc2965_desc'] = 'Файлы куки, полученные сервером, недействительны. Обновите свое программное обеспечение или обратитесь к автору/издателю программного обеспечения, если оно не соответствует действующим стандартам Интернета (в частности, RFC 2965)';
$txt['behav_bot_rfc2965_log'] = 'Бот не совместим с RFC 2965.';

$txt['behav_proxy_connection_desc'] = 'Ваш браузер отправил запрос на неверную страницу.';
$txt['behav_proxy_connection_log'] = 'Запрос содержал запрещенный заголовок «Proxy-Connection».';

$txt['behav_pragma_desc'] = 'Ваш браузер отправил запрос на неверную страницу.';
$txt['behav_pragma_log'] = 'Заголовок «Pragma» без «Cache-Control» запрещен для запросов HTTP/1.1.';

$txt['behav_te_error_desc'] = 'Ваш браузер отправил запрос на неверную страницу.';
$txt['behav_te_error_log'] = 'Заголовок «TE» присутствует, но не указан в «Connection».';

$txt['behav_invalid_range_desc'] = 'Программа, которую вы используете для доступа к этому серверу, не разрешена. Пожалуйста, используйте другую программу, в идеале — стандартный веб-браузер, такой как Firefox, Internet Explorer, Opera, Safari или Chrome.';
$txt['behav_invalid_range_log'] = 'Запрос содержит запрещенный заголовок «Range».';

$txt['behav_no_accept_desc'] = 'Ваш браузер отправил запрос на неверную страницу.';
$txt['behav_no_accept_log'] = 'Запрос не содержал заголовок «Accept».';

$txt['behav_invalid_win_desc'] = 'Ваш запрос отклонен; сведения о вашем браузере недействительны..';
$txt['behav_invalid_win_log'] = 'User-agent утверждал, что это IE, но заголовок был поддельным.';

$txt['behav_te_not_msie_desc'] = 'Ваш запрос недействителен; если вы используете браузер Opera, тогда он должен идентифицировать себя как Opera, а не притворяться чем-то другим.';
$txt['behav_te_not_msie_log'] = 'User-agent идентифицировал себя как IE, но присутствующий заголовок «TE» не используется браузером MSIE.';

$txt['behav_not_msnbot_desc'] = 'Ваш запрос недействителен; он утверждал, что вы связаны с крупной поисковой системой, но это требование не может быть проверено.';
$txt['behav_not_msnbot_log'] = 'User-agent идентифицировал себя как msnbot, но не может обосновать требования.';

$txt['behav_not_yahoobot_desc'] = 'Ваш запрос недействителен; он утверждал, что вы связаны с крупной поисковой системой, но это требование не может быть проверено.';
$txt['behav_not_yahoobot_log'] = 'User-agent идентифицировал себя как Yahoo, но не может обосновать требования.';

$txt['behav_not_googlebot_desc'] = 'Ваш запрос недействителен; он утверждал, что вы связаны с крупной поисковой системой, но это требование не может быть проверено.';
$txt['behav_not_googlebot_log'] = 'User-agent идентифицировал себя как Google, но не может обосновать требования.';

$txt['behav_not_baidu_desc'] = 'Ваш запрос недействителен; он утверждал, что вы связаны с крупной поисковой системой, но это требование не может быть проверено.';
$txt['behav_not_baidu_log'] = 'User-agent идентифицировал себя как Baidu, но не может обосновать требования.';

$txt['behav_offsite_form_desc'] = 'Данные были представлены из источника за пределами сайта; это не допускается.';
$txt['behav_offsite_form_log'] = 'Форма оказалась отправлена извне сайта.';
