<?php
// Version: 2.0; Themes

$txt['themeadmin_explain'] = 'Темы оформления позволяют преобразить форум до неузнаваемости. Эти настройки влияют как на выбор тем, так и на их доступность для гостей и других пользователей.';

$txt['theme_allow'] = 'Разрешить пользователям выбирать себе темы оформления.';
$txt['theme_guests'] = 'Сменить по умолчанию';
$txt['theme_guests_mobile'] = 'Сменить по умолчанию (мобильный режим)';
$txt['theme_select'] = 'выбрать...';
$txt['theme_reset'] = 'Сбросить у каждого на';
$txt['theme_nochange'] = 'Без изменений';
$txt['theme_forum_default'] = 'Тема по умолчанию';

$txt['theme_remove_confirm'] = 'Хотите удалить эту тему?';

$txt['theme_install'] = 'Установить новую тему оформления';
$txt['theme_install_file'] = 'Из файла';
$txt['theme_install_dir'] = 'Из папки на сервере';
$txt['theme_install_error'] = 'Эта папка не существует или не содержит темы оформления!';
$txt['theme_install_write_error'] = 'Для продолжения папка тем оформления должна иметь права на запись!';
$txt['theme_install_go'] = 'Установить';
$txt['theme_install_new'] = 'Создать копию используемой по умолчанию темы';
$txt['theme_install_new_confirm'] = 'Установить новую тему оформления?';
$txt['theme_install_writable'] = 'Внимание: невозможно создать или установить новую тему оформления, поскольку директория для тем не имеет прав на запись!';
$txt['theme_installed'] = 'Установка удачно завершена';
$txt['theme_installed_message'] = 'успешно установлена.';

$txt['theme_latest'] = 'Последние и лучшие темы оформления';
$txt['theme_latest_fetch'] = 'Невозможно получить информацию о последних темах оформления с wedge.org...';

$txt['theme_set'] = 'Использовать эту тему оформления';
$txt['skin_users'] = array(
	0 => 'Никто не использует эту тему.',
	1 => '1 человек использует эту тему.',
	2 => '2 человека используют эту тему.',
	3 => '3 человека используют эту тему.',
	4 => '4 человека используют эту тему.',
	'n' => 'Несколько человек (%s) используют эту тему.',
);
$txt['current_theme'] = 'Текущая тема';

$txt['theme_skins'] = 'Темы оформления';
$txt['theme_skin_preview'] = 'Предварительный просмотр';
$txt['theme_skin_set'] = 'Использовать этот вариант';

$txt['theme_edit'] = 'Редактировать тему оформления';
$txt['theme_edit_style'] = 'Изменить файлы стилей (цвета, шрифты, прочее).';
$txt['theme_edit_index'] = 'Изменить шаблон. (шаблон главной страницы)';
$txt['theme_edit_no_save'] = 'Этот файл не может быть сохранен, нет прав на запись. Пожалуйста, установите права на запись (chmod 777)';
$txt['theme_edit_save'] = 'Сохранить изменения';

$txt['theme_global_description'] = 'Это тема по умолчанию. Это означает, что данная тема применяется для всех пользователей, наряду с другими настройками.';

$txt['themeadmin_title'] = 'Темы оформления';
$txt['themeadmin_description'] = 'Здесь можно изменить настройки тем оформлений, установить новые темы, а также изменить параметры отображения тем.';
$txt['themeadmin_admin_desc'] = 'На этой странице можно изменить тему по умолчанию, сбросить настройки пользователей, выбрать другие настройки, относящиеся к используемой теме оформления. Здесь же можно установить новую тему.<br><br>Не забудьте заглянуть в настройки тем для изменения параметров отображения.';
$txt['themeadmin_list_desc'] = 'Здесь можно просмотреть список всех установленных на форуме тем оформления, изменить их пути и настройки, либо удалить их.';
$txt['themeadmin_edit_desc'] = 'Изменение отображения и исходного текста вашей темы оформления.';

$txt['themeadmin_list_heading'] = 'Обзор настроек установленных тем оформления';
$txt['themeadmin_list_tip'] = 'Настройки разных тем оформления могут отличаться друг от друга. Нажмите на название темы, чтобы изменить её основные параметры.';
$txt['themeadmin_list_theme_dir'] = 'Директория темы (шаблонов)';
$txt['themeadmin_list_invalid'] = '(внимание, путь указан неверно!)';
$txt['themeadmin_list_theme_url'] = 'URL-адрес темы оформления';
$txt['themeadmin_list_reset'] = 'Изменение URL-адреса и директории с темами оформлений';
$txt['themeadmin_list_reset_dir'] = 'Путь к директории с темами оформлений';
$txt['themeadmin_list_reset_url'] = 'URL-адрес директории с темами оформлений';
$txt['themeadmin_list_reset_go'] = 'Сохранить';

$txt['themeadmin_edit_browse'] = 'Обзор шаблонов и файлов этой темы оформления.';
$txt['themeadmin_edit_style'] = 'Изменить стили (CSS) этой темы оформления.';
$txt['themeadmin_edit_copy_template'] = 'Копировать шаблон с темы оформления, на которой он основан.';
$txt['themeadmin_edit_exists'] = 'уже существует';
$txt['themeadmin_edit_do_copy'] = 'копировать';
$txt['themeadmin_edit_copy_warning'] = 'Когда форуму необходим шаблон или языковой файл, находящийся не в текущей теме оформления, он берется из темы, на которой основан шаблон, или из темы по умолчанию.<br>Если изменение шаблона не требуется, лучше не копировать его.';
$txt['themeadmin_edit_copy_confirm'] = 'Хотите скопировать этот шаблон?';
$txt['themeadmin_edit_overwrite_confirm'] = 'Хотите скопировать этот шаблон поверх уже существующей копии?<br>Все сделанные ранее изменения НЕ СОХРАНЯТСЯ!';
$txt['themeadmin_edit_no_copy'] = '<em>(невозможно скопировать)</em>';
$txt['themeadmin_edit_filename'] = 'Имя файла';
$txt['themeadmin_edit_modified'] = 'Последнее изменение';
$txt['themeadmin_edit_size'] = 'Размер';
$txt['themeadmin_edit_bytes'] = 'б';
$txt['themeadmin_edit_kilobytes'] = 'Кб';
$txt['themeadmin_edit_error'] = 'Редактируемый файл вызвал следующую ошибку:';
$txt['themeadmin_edit_on_line'] = 'Строка';
$txt['themeadmin_edit_preview'] = 'Предварительный просмотр';
$txt['themeadmin_selectable'] = 'Темы оформления, разрешенные для выбора';
$txt['themeadmin_themelist_link'] = 'Отобразить список тем оформления';
